{
  "lastUpdated": "2026-02-05T20:26:35.525Z",
  "locations": [
    {
      "name": "Harolds Chicken Shack",
      "address": "612 S Wabash Ave, Chicago, IL 60605, USA",
      "neighborhood": "Chicago",
      "lat": 41.8739686,
      "lng": -87.626306,
      "rating": 3.8,
      "reviewCount": 890,
      "reviews": [
        "Food was amazing. The host taking my order was extremely polite and sweet as she could be.  It was a little slow to get but worth the wait.  Only critique I have is it smelled a little like a nursing home inside.  But the food was fantastic.",
        "Mac and cheese chicken bowl was terrible. No flavor, pasta was hard and they melted some mozzarella cheese (at least I think) on top. Also, the wings too salty. Harold’s in name only and not quality of food. Need to eliminate some of the menu to focus more on the quality of food. Took chicken nuggets out of bowl but they were not good either.",
        "This location seems to be better than the other ones i’ve visited. I picked up my order and it was the best while eaten hot! The flavor was there and the chicken was decent. Will visit again!",
        "They used to be good now they are nasty. My mom called about her food which was still warm btw since the large Mexican girl wanted to think it was cold. That catfish crumbled up like dust!!! My shrimp was overcooked and she didn’t want to give me a refund but gave a refund on the fish. No I brought back everything but it’s ok I’ll try to corporate number but I’ll dispute with my bank. Shorty that’s more money in my pockets when I call my bank",
        "I used to be a regular here in the mid 80’s when I lived in Hyde Park. Loved the hot chicken with fries and hot sauce poured all over the chicken and fries. Brought back great memories 40 years later to see it was still here and same great taste."
      ]
    },
    {
      "name": "Harold's Chicken Shack West Loop",
      "address": "1501 W Madison St, Chicago, IL 60607, USA",
      "neighborhood": "West Loop",
      "lat": 41.8812515,
      "lng": -87.66490220000001,
      "rating": 3.6,
      "reviewCount": 1455,
      "reviews": [
        "I can never leave home without stopping at Harold’s.The food tastes just like I remember growing up. I got a perch and wing meal with mild sauce and then a 6 piece wing for the next day. It was busy due to it being the night before Christmas. Ordered before I got there and everything was hot and ready. If only there was a location near me 😩 Everything was outstanding.",
        "Ordered my food online and it was ready at the given time. There is plenty of paid street parking but if you run in and run out you can probably avoid having to pay. The cashier greeted me and he was pleasant. My order was correct. The fries and chicken were piping hot, fried correctly, and fresh.\n\nI hadn't ate Harolds in maybe 5 years before today. I just think there are better options for the price. $10 for 4 wings and fries is a bit much to not be perfect. The chicken was hot and fresh but lacked flavor. The only seasoning I tasted was the salt and pepper I requested.\n\nWould I eat it again? Yes. But it will probably be another 5 years.",
        "I ordered 6 wings (mild sauce on side + hot pepper) via Uber Eats and this is what was delivered to me. 5 tiny wings and a handful of fries. For $30 on the app (I get fees and all). But what a disappointment! Please do better!",
        "The restaurant is good for a snack. There is a big menu but unfortunately they only had fries as sides available (maybe because we joined for only lunch).\nThe wings with its mild sauce was very good.",
        "This place is extremely famous for their chicken and we were quite happy with the food! We tried their shrimp, chicken tenders, wings, green tomatoes and hush-puppies. Everything tasted good even if the mild sauce was a little too mild, adding little taste. It is possible to park in the from of the restaurant and the area looked okay. If you are in the area you should give it a try!"
      ]
    },
    {
      "name": "Harold's Chicken Shack",
      "address": "2132 S Michigan Ave, Chicago, IL 60616, USA",
      "neighborhood": "South Loop",
      "lat": 41.8532282,
      "lng": -87.624088,
      "rating": 3.4,
      "reviewCount": 760,
      "reviews": [
        "I ordered  gizzard and Wings, the wings  was great but the gizzard was if they were out the freezer microwave them fried ti add batter which might understand the wait after it was a phone order first. I tried to call but no answer and the voicemail is full. I like to have the business correct any mistakes first before I post a comment. Also a coworker on the same ordered Livers was so dark as if dark grease was used. FYI, if gizzards are not popular delete them from your menu! I would've order fish & wing.",
        "Food is amazing, service is super slow. The ladies behind the counter have no sense of urgency, not a care in the world. Waited over an hour, as people kept coming in she would tell them that the wait is only 20 minutes. She would ask customers to speak up when ordering, but when she called the numbers she would whisper.  Management needs to do better.",
        "It was about a 40 minute wait for my food which is understandable because it was after a bears game. I didn’t expect too much coming into this restaurant but man I was blown away by those chicken wings and mild sauce. Some of the best chicken wings I’ve ever had. Fries were a little bland and didn’t have salt which maybe you could’ve asked for some but they put sauce on them too which made them better. Overall a great experience and I’d definitely eat here again.",
        "My order is always the same, but today, I tried something different. 6 Wings, salt, pepper, and lemon pepper. Mild sauce on the side. This was more expensive than my typical 6 Wings, salt, pepper, lemon pepper and mild sauce. I stated just put the sauce on the chicken. I waited 30 minutes for my order. I got home and there wasn’t a drop of mild sauce on my chicken! But, I was charged for it. I’m disappointed! Couple this with fact last my order was mixed up with someone else’s order and was fried hard with pepper juice on it. The wait time, unpleasant attitudes, and order mishaps always ruin this experience for me. They collect your receipt to redeem your food which would make it difficult to resolve the issue once you’ve walked out the restaurant.",
        "🗣️TRASHHHHHHHHH!\n\nWent there to get a lemon pepper fried hard wing dinner  and salt and pepper wing dinner- started eating the chicken and saw that it was still raw on the inside- no lemon pepper in sight - no fried hard. I took it right back and  told them to look at it. Instead of them delivering good customer service and remaking  the order - they made me wait 30 mins while they made every new customer order - when I asked how much longer on the order the young woman at the woman caught an attitude.   I simply wanted to know much longer I needed to wait for a remake. 10 minutes after this…. Then- Some crip keeper man come out the back talking about - “we not gon service you no mo-“ at this point I just want my money back- so now we have to have a debate about that. Terrible customer service and they never know who they are servicing 😉. I had to tell the lady calm down at the window, stop yelling and give me money back- a whole hour+ from the initial order to returning it  to finally getting my refund. I had to go to the one on Wabash and Harrison just so I could get my kid her wings and fries. Horrible!!!"
      ]
    },
    {
      "name": "Harold's Chicken #55",
      "address": "129 W 87th St, Chicago, IL 60620, USA",
      "neighborhood": "Auburn Gresham",
      "lat": 41.7359787,
      "lng": -87.62793119999999,
      "rating": 3.9,
      "reviewCount": 1559,
      "reviews": [
        "You can never visit Chicago without stopping at a Harold’s Chicken! This Express location is mainly takeout.  Seating is available, but it’s mostly for waiting for your order.\n\nOnce I looked over the menu, I was ready to order. I’ll be honest, the ordering process was a little awkward at first. It was hard to tell if the cashier was ready, and I got a very faint “may I help you.” I placed my order, and there was no response at first, which made me laugh a little. After a short pause, she entered the order. When I asked a question about a few of the menu items, the response was very brief. Not the warmest interaction, but hey, I was there for the food.\n\nAnd the food absolutely delivered!  We ordered a 10-piece wing dinner with fries, catfish dinner with fries, and fried okra. Each order came with their signature white bread and “mini” Cole slaw.\n\nEverything came out hot, fresh, and cooked just right. Nothing was overcooked, the seasoning was on point, and the sauce was perfect, not too thick and not too thin.\n\n“Mmm delicious” is truly an understatement. Despite the minimal customer service, the food quality alone makes this spot worth it. I highly recommend this restaurant if you want classic Harold’s flavor done right.",
        "We stopped here for early lunch.\nOrdered 2-7 pc chicken wing dinners with mild sauce.\nFood was up in a matter of about 20-25 minutes. Presentation was totally inviting. Yummy hot golden wings / fries with just the right amount of sauce. (drenched)\nWings were crunchy and juicy.\nThe fries were perfect. Oh let's not leave out that hidden slice of bread that was at the bottom covered in that special Harold's secret sauce. Entire meal was chef's kiss of carry out.  Simply delicious.\n\nI've heard that this is the best location. I tend to agree.",
        "I have been searching for a good Harold’s since the location on 14th and Michigan closed down. Before trying any restaurant, l always read the reviews.  Despite the 3.9 rating, I decided to give this location a try and I was highly impressed! I went around 6pm on New Year’s Eve and baby it was CROWDED,  so I knew the food was going to be HOT & FRESH!!  AND IT WAS!!! I ordered 4 wings fried hard with mild sauce and black pepper.  The wings were crispy and tasted so clean - no funny aftertaste. The fries were cooked to perfection. Their mild sauce was good, not too tart or sweet. My wait time was roughly 30 minutes which wasn’t bad at all considering the day. The cashier and other staff were pleasant - nobody had a stank attitude. Overall, my experience was AWESOME⭐️⭐️⭐️⭐️⭐️\nThis is definitely my new go-to Harold’s!!!👍🏽👌🏽🗣️SPREAD THE WORD!!!",
        "I’m a truck driver who works out of Chicago and I was bobtailing and I decided hey, it’s right off the freeway, why not stop here to grab something to eat. I loved it. Chicken was hot and fresh. My only regret was not getting extra mild sauce. I’d come back.\n\nSorry about the pic quality but still. it was good.",
        "This came from an Uber Eats order today, and the chicken is old and smelly. It’s supposed to be for my toddler. I wouldn’t give this to a dog.\nUpdated response: This review was meant for #55 express, and not this location #55. However, if the owner is the same, they need a lot on the other side of the expressway because the meal was unacceptable."
      ]
    },
    {
      "name": "Harold's Chicken Shack #36 (Wicker Park)",
      "address": "1361 N Milwaukee Ave, Chicago, IL 60622, USA",
      "neighborhood": "Chicago",
      "lat": 41.906721,
      "lng": -87.67137699999999,
      "rating": 3.5,
      "reviewCount": 599,
      "reviews": [
        "While visiting Chicago I was able to visit Harold’s Chicken #36. I ordered it the “Chicago way” — salt, pepper, mild sauce. It was fresh out the fryer, which already earned it points before the first bite. I was the very first customer so the order took some time which they warned me of when I placed my order.\n\nThe chicken itself was the highlight. Super crispy on the outside — Juicy and cooked perfectly. It was fresh and made to order.\n\nOnce you got past the outer crisp, the meat itself was a bit plain. Not bad by any means — just… lacking the flavor I'm use to. I assume this is because the sauce is the overall highlight.\n\nNow let’s talk about that mild sauce. I know it’s a Chicago tradition and a Harold’s signature, but it didn’t really do it for me. It had a slightly sweet, tomato-forward taste that reminded me a little too much of ketchup that's diluted with vinegar. Not terrible, just not the flavor bomb I was expecting. It kind of coated everything without elevating it. I prefer MUMBO sauce wayyyyyy more.\n\nAll in all, I’m glad I tried it. It’s part of the culture, and the freshness and texture alone made it worth the stop. But if we’re talking strictly about flavor, it didn’t quite live up to the hype for me.\n\nFinal Verdict: Worth the experience, but not a must-have repeat.\n\nRating: 7.8/10",
        "I THINK this is one of the original Harold’s of Chicago:   THINK.\n\nAbsolutely drop dead traditional made to order only fried chicken.   Priced right, carry it out and always tip your bartenders well.",
        "When you look beyond the exterior and the restaurant itself and just focus on the food  this place is the almost perfect place for fried chicken , the portions in comparison to the price is amazing , the tenders are HUGE and juicy and their bbq is AMAZING. And the fries are also tasty, I would eat from there over and over again. It is good to note it is a TAKE OUT place. Don’t expect to sit in.",
        "I ask for lemon pepper I guess I got it right I mean right what do wild see. This is my first time ever in Chicago tasting this if I’m wrong let me know",
        "If you just care about going from hungry to full with delicious food at a fair price. This place does just that.\n\nOrdering ahead and picking up to go is probrably the best way to get food here.\n\nPros: Perfectly fried and seasoned fish and chicken, generous portions. The chicken was juicy and crispy and not too heavy. Usually fried catfish is tough to get right but here it was perfectly balanced with tenderness and juicyness and crispyness.\n\nCons: Limited dine-in capability, fresh to order meals take at least 20min (was worth the wait)."
      ]
    },
    {
      "name": "Harold's Chicken Hyde Park",
      "address": "Kimbark Plaza Parking Lot, 1208 E 53rd St, Chicago, IL 60615, USA",
      "neighborhood": "Hyde Park",
      "lat": 41.8000542,
      "lng": -87.5960602,
      "rating": 3.6,
      "reviewCount": 950,
      "reviews": [
        "Great tasting chicken but, damn do the employees have to pay for sauce out of pocket? This chicken is way too dry for the price!! Also, if you ask for more sauce they force you to buy extra in a cup which is not the same and defeats the purpose of adding sauce while the food is hot! I’m giving a 1 star because, this is not how original Harold’s is served!",
        "Normally I can order my food and pick it up without a problem but today when I went to pick up my order, I tried to tell one of the women, looks to be in her 40s, that I made an order and when I said my name, she ignored me and started calling numbers from 62 to 67, and then another woman walks up and said she called in an order, now another woman in the back gets her food and I’m trying to get mine after her but the older woman just calling numbers, still ignoring me. I finally tell the younger woman I ordered through grub hub and I tell her my name like I told the other woman and she gets my food for me. I don’t know what the older lady’s problem was but she needs to get better customer service skills or stop working the register. It doesn’t take a lot just to learn to listen  and stop ignoring people especially when they’re not disrespectful. I won’t be coming back here ever again.",
        "I purchased 5 wings and they were pretty decent but the fries were hard, dry, and some what soggy. Can't eat chicken from harolds if fries not right. Places since Covid have really went down",
        "Not going to lie I gave up on this Harold’s years ago because the food quality and service had fallen off. But today I decided to give it another chance and ordered 15 wings. The line was long but they were moving people in and out quick. And honestly… they made a comeback. The chicken was fye, fresh, and crunchy just how I like it. Even my 5-year-old said Mama this chicken fye",
        "I ordered a fourth white with just lemon pepper I received what looked like a fried rat with a bunch of sauce ,this Harolds has went really down and when you try to call, they don’t pick up the phone. I wouldn’t recommend this place at all."
      ]
    },
    {
      "name": "Harold's Chicken #88",
      "address": "124 E 35th St, Chicago, IL 60616, USA",
      "neighborhood": "South Loop",
      "lat": 41.8312232,
      "lng": -87.6221193,
      "rating": 3.9,
      "reviewCount": 933,
      "reviews": [
        "Chicken is good but every time I go there I ask them did they put my coleslaw in the bag and they always lie and say they did. I open the bag in front of them EVERY TIME and it’s never in there! Why lie about that? And yall charging 50 cent for it and don’t wanna give it out.",
        "Chicken was good but the fries was trash. I don’t feel like you should re-drop French fries because they look like the picture I’m attaching. Smh. Very disappointing when a 6 wing is 15$ and you can’t even eat the fries!!",
        "We were in Chicago on vacation and our first stop was to Harold’s Chicken off 35th street. James the owner was super nice.  We had gizzards, liver, cat fish, coleslaw, wings and grapes with toffee. EVERYTHING was delicious!! The grapes were surprisingly delicious. The sauce did not disappoint! I’d recommend you check out Harold’s Chicken on 35th street.",
        "I love Harold's ❤️ My order was hot, fresh, and quick. The service was great from beginning to end. I ordered 2 6 piece wing dinners, which included fries and their famous mild sauce. It was delicious like always.",
        "I went in and ordered two 6 wings. these people gave me a 4 wing and a 6 wing. I would’ve been cool with it if they put the right stuff on top. They gave me all hot sauce and hella salt and pepper on my wings. WHO GOES TO HAROLDS AND ONLY GETS HOT SAUCE ON THEIR CHICKEN???? Harold’s is known for MILD SAUCE. The cashiers are just dumb ditzy ho’s. Then they have the nerve to not answer their phone. Horrible service and horrible food. Im blew asl. Looking at my receipt she charged me for stuff i didn’t asked for the lady was old but if she’s too old to comprehend simple requests then she needs to be fired."
      ]
    },
    {
      "name": "Harold’s Chicken Shack",
      "address": "917 W 87th St, Chicago, IL 60620, USA",
      "neighborhood": "Auburn Gresham",
      "lat": 41.7358575,
      "lng": -87.6468599,
      "rating": 3.9,
      "reviewCount": 972,
      "reviews": [
        "Man 🤩 idk what it is about this specific Harold's Chicken location but it hits Everytime! I got the 1/2 white dinner and when I tell you every piece of chicken was fire that's exactly what I mean! Always loved their food and variety. Only thing is I feel their wings can be too expensive vs the actual dinners cause I feel like you're getting a better value when you get the dinner over the wings but other then that they are definitely excellent and a Chicago staple 👌🏾",
        "This location use to be good but has drastically gone in the wrong direction! I ordered 6 wings extra mild sauce which I was charged for the chicken was hard and old looking with very little sauce. I went bk and the was giving garbage again. It's 2025 and don't nobody have money to waste so it's safe to say that I won't be patronizing this business again.",
        "Haven’t had any Harold’s Chicken in years. I’m not a chicken person but I tired it. I use to go to this location a lot like years ago. The cashier was cool and the inside is the inside. It’s not finna b all brand new this is Harold’s Chicken we talking about in the trenches. It was busy that’s to b expected. The chicken was decent but not how it use to be when I went 5 years ago. I got a half dark fries hard with mind sauce to the side.",
        "My favorite Harold’s !! Love their sauce so baddd , just be packed whenever I go but it’s worth it !!!",
        "They think they the best Harold’s in the city. So they keep going up on they prices and this time they put my mild sauce on the side. I said salt paper and mild sauce never said on the side! Bad Business owner and worker even worst!"
      ]
    },
    {
      "name": "Berwyn Harold's Chicken & Bar",
      "address": "6307 W 26th St, Berwyn, IL 60402, USA",
      "neighborhood": "Chicago",
      "lat": 41.8435394,
      "lng": -87.78148499999999,
      "rating": 4.3,
      "reviewCount": 58,
      "reviews": [
        "The chicken was fresh and hot, the lemon pepper was delicious and of quality. The customer service was excellent 👌 and the vibe was pleasant. This place is unique and brilliant!",
        "First time coming to a Harolds like this. I traveled 50 miles to get to a harolds as it's been over 5 years since having some. The food was so hot and fresh. The atmosphere was nice came on a Sunday during the football game. Nice crowd. Be patient as the food is made to order expect to wait 20-25 mins. Would come again.",
        "This place is weird but in a good way. Where better to have a Harold Chicken than in a …car wash/detailing center/Bar? Crazy, right?  Now the chicken. It’s everything you expect. Delicious, hot and fresh. They make everything on demand so it’ll take like 20 min for your food to cook if you are ordering for more than 1 person. They people here are super friendly and that’s a big plus for me. Been here like 3 or 4 times now and the food never disappoints.",
        "I ordered online and walked over to pickup.  The food was on time, hot, fresh, and delicious.  Maybe they had a rocky start? but I didn't experience any of the problems people have mentioned in other reviews.  Plenty of sauce (I ordered it on-the-side), and not greasy-- even the lone piece of white bread on the bottom of the bucket wasn't.\n\nWill be going back.",
        "I got a full car wash and they left it all dirty. They didn’t clean the inside at all and the outside was still dirty and wet. They spend around an hour to be done with it and they left it worse than it was. The inside was left wet with stains. My car key fob was push all the way inside and I was unable to press the lock button like if they had stepped on it. The good reviews are probably for the food and not the car wash. The trunk was not touch at all. Not worth $40."
      ]
    },
    {
      "name": "Harold's “The Fried Wing King “",
      "address": "1118 W Wilson Ave, Chicago, IL 60640, USA",
      "neighborhood": "Chicago",
      "lat": 41.9655306,
      "lng": -87.65847769999999,
      "rating": 3.6,
      "reviewCount": 370,
      "reviews": [
        "This is a Chicago staple. I got buy 2 get 2 free on Doordash. However, I have dined in before too.",
        "This place is a total scam. I ordered a buy 1-get-1 chicken sandwich offer from uber eats.  They put a long piece of fried chicken (half of which was paper thin) and placed 4 buns on it. A total of 8 fries. They completely ripped me off. If they're cutting corners on their specials, what other shady stuff are they doing? Don't eat here.",
        "They get away with the high pries because this is the Northside and the people don't know any better. You play more and get less at this location and it don't taste like Harold's for real. I ordered here off Uber Eats. Supposed to be a buy one, get one free catfish nuggets meal. Come to find out they only give you 5 nuggets and combine both orders in one tray. With only 1 order of French fries. Now I never heard of a 5 piece cat fish nugget. It's usually just large or small. The fact that you would charge that price for small pieces is crazy. I suggest people avoid this place and go out south or to the Harold's on West Howard. Better prices and taste like real Harold's.",
        "This Harold’s food is decent, but the problem I have is that they are flexing a proud black owned badge in the window, but the workers are Caucasian frying the chicken, yes very strange. And she’s doing a great job, although she’s working alone as the cashier and also the cook. So please don’t be in a hurry coming here.\nCook is very white not black the reply is a lie, also ordered wings from here 12/22/25 and the wings were not seasoned , I ordered them with out sauce on purpose so I could taste them without distraction, they were unseasoned and tasted like the oil needed to be changed",
        "Ordered through Uber eats. Did not receive coleslaw or bread and catfish had ketchup all over it. Ketchup should’ve been on the side. No answer when I called restaurant mailbox is full"
      ]
    },
    {
      "name": "Harold's Chicken Shack #35",
      "address": "12700 S Halsted St, Chicago, IL 60628, USA",
      "neighborhood": "Roseland",
      "lat": 41.6628943,
      "lng": -87.6418593,
      "rating": 3.6,
      "reviewCount": 1071,
      "reviews": [
        "My first time ordering here. I went in it wasn't very crowded. I saw 3 people waiting. THE MUSIC was blasting I could barely hear the lady taking my order. Ordered 5 wings salt pepper mild on side. They call my number I showed the ticket. I was surprised the order came out quickly I didn't think nothing of it.\nGot home realized They gave me 4 Wings instead of 5. Tried to call no one answered and the phone kept hanging up. I will Not come to this location again. 😤 Bad Service and my chicken was cold. Im sure they gave me the wrong order.",
        "Amazing chicken. They also sell deep fried catfish and they are really good. The location is a bit far from Downtown but still reachable. Must try place if you are in Chicago.",
        "I did not enjoy my experience here. I followed the hype, from Tik Tok, and wanted to get a taste of Chicago. I ordered the 4 piece wings and fries. I threw my fries in the trash. My fries were not hot. The chicken is mediocre. Nothing that made me feel like it was good chicken. Honestly,it felt like a waste. I’m open to trying another time and maybe another location one day.",
        "Ordered 18 wings waited 20 minutes… cool! Get the food it wasn’t hot as if they just fried it… get home it’s pieces of paper in it and it looks as if they broke down orders they had that people hadn’t picked up and made me a an 18 piece… fries weren’t hot and they put so much sauce on it to try to cover up the fact that it wasn’t fresh chicken… the sauce isn’t what it use to be it was kinda bitter… big disappointment had to put it in the air fryer because I didn’t want to hand it back and they play with it or get a refund and go somewhere else because it wasn’t fresh chicken already after 10pm…. But I will not be getting anything else from this location!!!! They’re supposed to have insurance for spoilage not push it off on a loyal customer….sad!!!",
        "The food and service was great, but while I was ordering, a man that works here came in loudly yelling and cursing at the lady that was taking my order and everyone in the lobby could hear him yelling. The man in back was extremely unprofessional and abusive to the lady that was taking orders. I’m not sure if he’s a manager, but if he is he needs to be fired immediately.  Your employees should not be subject to that kind of abuse. This happened on 12/20 around 2:45pm."
      ]
    },
    {
      "name": "Chicago Lawn Harold's Chicken #17",
      "address": "2900 W 63rd St, Chicago, IL 60629, USA",
      "neighborhood": "Chicago",
      "lat": 41.7794552,
      "lng": -87.69618849999999,
      "rating": 4,
      "reviewCount": 115,
      "reviews": [
        "New night manager is rude blocked my number from calling the store I ordered food to feed my kids and online the options are different from her poor excuse for messing up my order why give me bland chicken then claim it’s a charge for sauce on the side not on the chicken I have a toddler that doesn’t like sauce on his food how is one cup of sauce enough for a 24 piece and fries then she claimed they are not able to add lemon pepper on the side in app it said free but I got up charge for one sauce. Mind you this is my 10th time eating at this one will not order from here again chicken didn’t look like it normally does either highly frustrated",
        "It was great and the $2 chicken only on Tuesday and $1.50 on Wednesday is great for everybody in need of some good fried chicken! So your and fresh made to order! Right on time!",
        "Today was my first time here and I must say that the food was good,  hot, fresh, and  the service was speedy! They give you a nice amount of fries, one piece of bread, and cole slaw upon request. Definitely will go back and the inside was clean of you wanted to eat in there! Parking is hard to get since it's other businesses in that small area!",
        "One of my favorite Harold’s! I’ve never had an issue ordering ahead and picking up. The food has been consistent…except the okra. Please change be back to the original okra. Thank you to the staff for being great always!",
        "I just landed at Chicago Midway Airport, and I'm hungry. I'm a native of Chicago, and I know where to find the eats. These wings were on point. Enough said.  🍗"
      ]
    },
    {
      "name": "Harold's Chicken Shack #69",
      "address": "9938 S Torrence Ave, Chicago, IL 60617, USA",
      "neighborhood": "South Chicago",
      "lat": 41.7142046,
      "lng": -87.5599723,
      "rating": 3.2,
      "reviewCount": 58,
      "reviews": [
        "Ms. Gina was a delight to speak with. She explained her way is a fresh drop when ordered. Definitely had some of the best tasting chicken.  With them dropping fresh. She said she needs 25 with anything with a bone in it.",
        "The customer service there is horrible and awful. I will never set foot in there again.  I hope they are shut down.  I received my order (which was a delivery btw) and it was wrong! I ordered six wings with mild sauce and paid extra for extra sauce. I get my order and it’s completely dry!  I get in my car (which is an inconvenience) and drive up there. I’m met with an attitude and  hostility, all because THEY messed up my order.  No apology or nothing. At the end of the day, I want what I ordered and should not have to argue with the employee that messed up the order. The young man who runs it when his mom is not there needs to be fired.   IT BE YOUR OWN PEOPLE.",
        "The worst Harold's we have ever been to in our life. The staff attitude was so unprofessional and rude. We waited right at an hour for our food for it to be cold as heck after the long wait. We spent right at $70 and they gave me 1 hot/mild sauce for 4 different orders of food.\nOrdered a small gizzard dinner and it was only 6 pieces in there.  Ordered 10 wings for $19.49 and had to throw it away because it wasn't fresh.\nThe lady attitude was jacked up because I asked her how much longer for my food and it went downhill from there. I asked for my money back but of course that was not an option.\nTo save from writing a book about this place, the easiest way to put it is, save your money and your time by going somewhere else if you don't want to be disappointed!",
        "Highly disappointed in the lack of flavor!!! There was no seasoning whatsoever. The restaurant was clean and the customer service was excellent!! The chicken was hot and fresh but it was the most flavorless Harold's I have ever had. Unfortunately, I will not be returning to this location.",
        "Very unprofessional customer services Issa keeps a business open. You can’t have cashier unaware of what menu items are not available before taking a customer money and having them wait thirty minutes. Then to be told after asking for a refund remember that after you let them know you don’t want four wings after waiting thirty minutes. I will never be back to this Harold again worst in the city. I expect more from black business"
      ]
    },
    {
      "name": "Harold's Chicken #24",
      "address": "407 E 75th St, Chicago, IL 60619, USA",
      "neighborhood": "Chatham",
      "lat": 41.7582166,
      "lng": -87.61460439999999,
      "rating": 3.9,
      "reviewCount": 848,
      "reviews": [
        "I called my order in the cashier told me 20 mins I took 35 mins to come. I came in no line empty still waited 8 mins. She told Me a french fry is $5 and some change, but online it’s about $3. She said “oh well the owner need to update it”. This used to be my favorite one. That Lady attitude and her customer service is horrible, I see why I done walked in a couple of times and customers is cussing her out. Black business customer service needs to do better or go find something else!",
        "I love Harold’s but I didn’t know that all their sauces were different at least at this location. The food was cooked properly but that mild sauce was completely off and threw the whole meal off. Please stick to the original sauce and the wait was pose to be 20 mins but instead 35 mins.",
        "The food is edible, but not the best. I didn’t taste much flavor and the fish pieces were thin, however, the shrimp were pretty good. The service is not up to par as well. The house sauce/ special sauce (mild) is not mind-blowing. I couldn’t finish it. And to think I was excited to eat here….I guess I should’ve got the chicken. Pretty pricy as well!",
        "Food is delicious but service is HORRIBLE. It has gotten worse over the years. What is the purpose of calling in if I still have to wait an hour for my food to cook?!? Then the clerk wanna get jazzy because I asked how much longer do I have to wait! Then tried to tell me I didn’t let them know I was here…well how did I pay for it and have a receipt in my hand?? I try my best to support my people but my people MUST do better. We don’t owe you anything. YOU depend on us!",
        "When I say never I mean never ever will I go to this Harold’s. I’m assuming they got mad because I place an online order fish 18 and wings 13 I chose the option for mild sauce on my wings and paid for extra. When I went to pick my order up I over heard the cashier taking an over the phone order and the customer was saying she didn’t want the bbq sauce she wanted mild, the cashier went to explain that they do not carry the “original” Harold’s mild sauce and they only have the Harold’s bbq sauce. While I never tasted the bbq sauce my son has and he doesn’t like it on his chicken, I say that because when picked my order up and heard the conversation, I explained I didn’t want it on my chicken. So at the bottom of my fish this is the bread I have. When I say they had to dip this bread in grease and lay it in the tray that’s exactly what they did. I don’t care what changes a customer wants to make to their order this type of behavior is never okay. This is crazy that I paid $35 for this, as a black business it’s trashy and classless."
      ]
    },
    {
      "name": "Harold's Chicken #55 Express",
      "address": "8653 S State St, Chicago, IL 60619, USA",
      "neighborhood": "Chatham",
      "lat": 41.7367169,
      "lng": -87.6239159,
      "rating": 3.6,
      "reviewCount": 527,
      "reviews": [
        "A little history here. I've been going here since the other one across the Expressway closed. And I had to say I was very impressed. Food was hot sauce, was tasty. Wings were a good size service.\nWas good, but recently that I mean within the last.\nEar, dear. I've gone in 3 times My first time within the last year, an incident occurred where I had placed my order. And a woman came into get her order upon getting her food. She was back in the restaurant within 8 minutes or so.  She came back in and complained to the staff that her wings were awfully salty. I didn't pay too much attention but I did hear Her. And upon her complaint, the staff Beth didn't refund her order. They were just saying well. No, it's not salty.  And I was like, wow, unfortunate for her, but as time passed, I got my order, I decided to sit in there. I like the ambiance. So no problem with the exception of a few flies that smell the sauce and.\nI'm going to partake. Are I usually get 5 to 7 wings opening the bag in the package?  You know how it is wet and saucy paper. Listening in the Sun tables painted with Harold, zimblem and historic symbolism. I was feeling great.\nFood was hot.  Just a perfect amount of sauce. Not drenched and not extremely decided to go ahead. Figure, oh God was at disappointment, salty salty salty and I found this the perfect time to address the staff like the woman before me.  I did. The lady's response was, oh no, well, it's not salty. It's just the seasoning that they put in, because you said no soul. Yes, but man, it's salty, are you listening staff was combative argumentative and decided to say okay, might have been just one wing and I taste it  But no once I gain composer shut down, finish 2 to 3 more wings with some fries fries by the way, paddle salt, but the audacity of this person to tell me that it's not salty, and there is a salty witness before me who complained.  I said wow. This must be under new ownership. So I granted an eyebrow and I just enjoyed the sauce. But salty salty is the word to. Day no upon coming back within the next month or so same result salt. Once again, I mentioned it to the staff. Once again, oh.  It must be when they seize in the chicken. No matter the excuse fix it. I'm saying to myself, so show about a month or 2 later came back. Same result salty so either. I don't know if it's new management. New workers new recipe or just plain sabotage is what I'm thinking.  But go and try it and enjoy your salty chicken with the family of flies that I'm sure we'll be there. Well, upon my next visit.",
        "I was looking forward to this food all day and I’m extremely upset with the service I received. First of all, I placed my order to be picked up at 10pm. It was a 8 wing with two sauces on the side. Simple right? I guess not. One would assume that means the order wouldn’t be made until near the pickup time the customer selects. I literally walked in AT 10pm on the dot and was told that my food had been sitting there for awhile. I then told the lady that well I placed my order to be picked up at 10pm which is SHOWS on the receipt. She told me it was still a little warm but she then asked the guy in the back if he had 8 wings he could make and he acted like it was a problem and he couldn’t do it. I’m not the type to be a difficult customer or make a scene and she told me it was warm so I just let it go. I get home and my food is ICE COLD. THEN on top of that they didn’t even put my two sauces in the bag. So I paid nearly 25 bucks for ice cold chicken and couldn’t even get the sauces I paid for. What is the purpose of selecting a pickup time if you’re going to completely disregard it and make the meal way earlier when you feel like it to just get it out the way from what it seems. My food had to have been sitting for at least 20 plus minutes for how cold it was. I’m extremely upset. I’ll know next time to just be the difficult costumer who pushes the issue if I ever even decide to come here again to begin with🗑️🚮",
        "I ordered a large gizzard and they were dirty. I mean, you know the bottom of the gizzard that piece you pull off it was on my fried gizzard. They never took it off. Also you could barely chew it because it was just that hard. I also ordered a white half and they gave me a dark half. There was only one other person in there when I was ordering my food.. So it’s not like they were busy.",
        "First I don’t like giving bad reviews but I should have know something was wrong ordering online and it was ready in about 10-15 minutes. I specifically said do not fry hard , lemon pepper and mild sauce. None!\n\nI ordered two extra sides of mild sauce , gave a tip , it was not a freshly cooked ordered, you can tell it was refried or it’s old and been sitting, as high as food is, why would people do things like this to people’s orders, thus is not good customer service and I’m pretty sure if the shoe was on the other foot they would feel the same way.\n\nI understand mistakes can happen but at the expense of how high food is and the health of a customer , it is not right or professional.\n\nIt has me feeling sick to my stomach and the money I spent.\n\nThis needs to be discussed and changes made immediately.",
        "I ordered 7 wings with hot and mild sauce. The meal was horrible. The worst I’ve had there. I’ve HONESTLY had 2 day leftover chicken that I reheated that was better.\nNo excuse for a order that I placed and waited for at 12:30pm during peak lunch time."
      ]
    },
    {
      "name": "Harold's Chicken Shack",
      "address": "7348 S Stony Island Ave, Chicago, IL 60649, USA",
      "neighborhood": "South Shore",
      "lat": 41.7611111,
      "lng": -87.5866667,
      "rating": 3.3,
      "reviewCount": 848,
      "reviews": [
        "I order from here a lot and tonight was my 1st time calling them to complain I was missing items and my fries was old and cold never did the person asked if I wanted to come get my missing items or replace my cold food but what took the cake was when the young lady stated I’ll tell the cook…. No compensate me AND BO LEMON PEPPER 😡😡",
        "I was in this Harolds on 12/12 2026 at 610pm. The young lady at the register was counting her drawer down. She never acknowledged me waiting to order.  But the part was when she walked away came back, walked away again and sat down on her phone and never said anything.  When I said excuse me, she came back to the window and said nothing, holding her phone. I walked out. My 11 year old son looked at me and said \"why are they so rude to people everytime we are in here. Then he said \"that lady was extra rude for no reason\". I hope the manager/owner reads this because she should not work with the public. We come here alot and the service has never be good ,but the food was fresh. I would never recommend this Harolds again.\nFormer customer:(",
        "I’ve been coming to this Harold’s for over 13 years, and year over year they’ve progressively gotten worse that’s ended them where they’re at currently - in the toilet. Their service is the worst part of the experience. In addition to lying about their wait times (often taking an additional 1.5 hours for 1 simple order), their actually employees are unpleasant, nonchalant and unprofessional. It’s disheartening to see a spot that was once able to be counted on for their punctuality and professionalism be ruined and turned into a disgrace to the Harold’s franchise.",
        "This location is horrible with poor customer service. I placed a DoorDash order for pickup and when I arrived I was told they didn’t have my order even after I showed them the confirmation. The man at the window was extremely rude and dismissive. I even said I would pay for the food again if he could just make it and he told me it’s not his issue and to take it up with DoorDash. I then left and called the store because DoorDash told me they spoke with them and the store told DoorDash they gave me my order. The young lady at this location who I spoke with on the phone was rude and cursed me out and said she didn’t “gaf about what I was talking about.” Terrible and they need to be shut down",
        "I had an awful experience with my first visit to Harolds Chicken last yr. So I was advised to try this location. It was amazing if there is one better than this i want to see it."
      ]
    },
    {
      "name": "Harold's chicken Oaklawn",
      "address": "4709 W 95th St, Oak Lawn, IL 60453, USA",
      "neighborhood": "Chicago",
      "lat": 41.7198159,
      "lng": -87.73880109999999,
      "rating": 3.8,
      "reviewCount": 181,
      "reviews": [
        "The first time I bought from here, shortly after they opened the Food was seasoned well, not stingy with the sauce. Service very friendly and efficient. Wings were a bit pricey 6 wings for $14. Gizzards reasonably priced. My number one go to!\n\nFfwd to almost two months later to today, I ordered the same thing. But they didn't put any lemon pepper as requested and was STINGY with the sauce. Very disappointing for the price and because it was early and not busy when I placed my order. I won't be back and I do not recommend this location--what a shame!",
        "I was the 3rd person to order food it was only 3 customers in there im just now getting my food and leaving from 240pm til now. 330pm My food wasn’t even fixed the way I asked 12pc wing bucket fried hard with lemon pepper family coleslaw and fries. Food wasn’t hard, no lemon pepper, gave me a small coleslaw, and somewhat warm family fries. I finally gets home get ready to eat I put 6 wings on a plate went to put the other wings on a plate and it’s only 5 wings so now I’m missing 1 wing. For it to have been my 1st time there, I will not be going back I will not be missing this location at all and the only reason it has any stars from me is because it wouldn’t let me post without putting the 1 star for each one",
        "I read many reviews before visiting this Harold’s Chicken location for the first time, and I’m really glad I did. The food was very good, the environment was clean, and the staff was welcoming and friendly.\n\nEven though the place was overcrowded, if any order got mixed up, they fixed it within a minute, which I really appreciated. I also want to clear something up for everyone — they do put lemon pepper every time when asked. The lemon pepper soaks into the chicken, which is why you may not see it on top, but the flavor is definitely there.\n\nAnother important thing: the chicken is fresh, so it takes about 25 minutes to prepare, but the wait is absolutely worth it in the end. The buy-one-get-one offer on the 6-piece wings was awesome too.\n\nOne suggestion from a customer: please consider extending store hours. People like me who work night shifts or late hours would really appreciate it if the store stayed open until 1:00 AM. It would be great for town residents and late-night workers.\n\nOverall, great experience, great food, and great service.\nAlso, please consider opening another location in or near Pulaski — that would be amazing!\n\nHighly recommended 👍",
        "Taste good but after the first time they got every order incorrect. One time everything was plain when I requested sauces and they messed up the make up order after repeating it back to me a few times. It’s either missing the sauces requested or plain. The make up order also didn’t have much sauce on it and this time included bread which my other orders didnt. I paid for extra sauce the first time and basically paid for nothing because it was the same amount of sauce as my husband’s order that had regular sauce. Maybe need to follow the instructions on receipt idk. It tastes good but just incorrect most of the time.",
        "By way of Texas! Stop by before going to Midway Airport and selected a 4 wing meal. The wings were freshly fried to order. This meal slabbed my taste buds with a delicious favor. The mild sauce was a first for me and in my opinion it complimented the chicken perfectly. I highly recommend."
      ]
    },
    {
      "name": "Harold’s Chicken Shack",
      "address": "713 Roosevelt Rd, Maywood, IL 60153, USA",
      "neighborhood": "Chicago",
      "lat": 41.864612,
      "lng": -87.84130549999999,
      "rating": 4,
      "reviewCount": 97,
      "reviews": [
        "I spent $75 and the fish was not done. When I took it back I ask to trade for their tea. The man behind the counter told me no because the tea is $7.00. I just feel if a customer is telling that there food wasn’t right you should accommodate that customer. I will never eat here again.",
        "Newer location. I visted the opening week. They had a 10 piece wing special. Food was hot/fresh. Good taste.",
        "I am so happy to have a Harold's out west!! A Southside native and Harold's connoisseur I have not been disappointed. The store is clean, bright and inviting. The menu is full, and not limited. Every item I've ordered has been in stock. The food has been fresh, hot and not refried. They also have steaked and filleted catfish!!😁 Authentic💯. The customer service team has been pleasant and friendly. They are also open late!! Everything I've experienced has been positive. While parking can be limited, I have been able to pull right up with no issues. I highly recommend!!💯💪🏾",
        "Hello Everyone,Family & Fellow Shackers today when I stood in line\n(3 people) Jordan let Me know he'll be with Me shortly saying just 5 more mins...Hmmm? That's the Great Customer services since he remembers my previous 7 orders & he already dropped my Pizza puffs !!! So I wasn't Late to work!! And Yess I tipped Him Good for that!¡! $$$",
        "Food very good well done and fresh thank you so much to open this place in maywood I love Harolds chicken"
      ]
    },
    {
      "name": "Harolds Chicken Shack #27",
      "address": "10259 S Halsted St, Chicago, IL 60628, USA",
      "neighborhood": "Roseland",
      "lat": 41.70715,
      "lng": -87.64261499999999,
      "rating": 3.6,
      "reviewCount": 990,
      "reviews": [
        "The lady at the window was rude. I asked her about sauce on my chicken and she said it was on the side. I  asked could they put it on and she said they won't take it back. I checked when I got to the car and saw it wasn't any on the side, either. I had to go back inside to ask for sauce. She then gave me 2 cups of sauce. Nobody should be that dry in customer service. I understand it's Harold's, but still...",
        "This has always hands down been my favorite Harold's since I started driving in 2000. I always tell people to go here. No matter what time of any day, this Harold's has NEVER failed me. Unfortunately today, I was highly disappointed. I ordered 6 wings with mild and hot and the wings were awful tasting. They were really dark, the fries were undercooked, and the sauce was completely different from what I've always had (not good).  I understand that change could be good but whatever changes they're making here is a bad decision. It's unfortunate because the cost of food now a days, I cannot support this location anymore due to this bad experience. I'll be sure to tell others of my experience today as well. Sorry!",
        "I always see debates about which Harolds is the best. This location on 103rd and Halsted has never ever disappointed! Food always hot and fresh. Cashier super friendly and I've never had to wait an unusual amount of time.\nMy ONLY issue is that they do not answer the phone all the time, so you may not be able to call in an order.",
        "This Harold’s slow as hell I’ve been waiting 40 minutes on 6 wings and no it wasn’t crowded. They also didn’t take call in orders. Food doesn’t taste fresh either",
        "I will never order from this Harold's location again. Every time, they fail to read the instructions on UBER EATS leaving me food I have to doctor up. It's frustrating because the wings are cooked to perfection, but clearly, somebody there can't read. They don't cook it fresh either; I have to reheat and make the food myself hot despite me living only a few minutes (5-minute drive). They never pick up the phone, so there's no way to resolve the issue. If you want decent food, go in-person and avoid ordering off Uber Eats. Look how they didn't even put SAUCE on the food 😤😤😤"
      ]
    },
    {
      "name": "Harold's Chicken Bronzeville",
      "address": "503 E 47th St, Chicago, IL 60653, USA",
      "neighborhood": "Bronzeville",
      "lat": 41.8092139,
      "lng": -87.613624,
      "rating": 3,
      "reviewCount": 143,
      "reviews": [
        "Affordable and delicious!  I don’t get to Chicago much anymore but when I do, Bronzeville Gap Harold’s is our go-to for freshly fried Fried Chicken with hot sauce on wonder bread!  Perfection every time!  And I’m able to grab a bottle of hot sauce to go!",
        "This place is absolutely terrible. The food, pricing, customer service, and even the location—all awful. We called in an order for the 10-piece wing special with lemon pepper seasoning on the wings and mild sauce on the side. We were told it would be ready in 20 minutes. When we arrived, not only was the food not ready, they were just dropping the fries. When we finally got home, we realized they didn’t include the mild sauce at all. The fries were undercooked, and the lemon pepper seasoning was dumped unevenly in one spot on the wings. We called to let them know about the issues, and the man on the phone was argumentative instead of apologetic. We paid over $21 for 10 poorly made wings and honestly, it was a complete waste. They’ll never get another dollar from me.",
        "I called several times to place an order and never got an answer…. Went there and there were only two people in there and both had already ordered…. I stood at the window for ten minutes and the girl who was taking the order never came to the window….. instead she decided to play music in the back…. I stood there and called the number to see if they would pick up… I never heard a phone ring…. The man who was cooking in the back was standing up nodding…. The girl pulled a cover so we couldn’t see…. I walked out of the place…. I do not recommend this Harolds",
        "Not only are you not open on a Thursday afternoon at 2pm, as I’m reading the reviews the owner responds to a customer by downplaying another Harold’s smh.. As a business owner that’s nasty work do better🤮",
        "I’ve enjoying the wonderful flavors of Harold’s since I was a child like most Chicagoans, and over the years the taste has changed, but this location definitely takes me back to the good ole days! The owners are always striving to make every bite your best! The food is always fresh, the sauce is perfect and when you say fried hard, that’s exactly what you get! Probably my new favorite location!"
      ]
    },
    {
      "name": "Harold's Chicken Shack #13",
      "address": "7318 S Vincennes Ave, Chicago, IL 60621, USA",
      "neighborhood": "Englewood",
      "lat": 41.761132,
      "lng": -87.63019919999999,
      "rating": 3.6,
      "reviewCount": 459,
      "reviews": [
        "Was craving some Yard Bird. On point Delish! Phoned in my order ahead of time and it was hot and ready when I arrived. Harold’s Chicken hasn’t changed, the white bread under your fries and chicken above, just love how the bread soaks up all that goodness. 5 pc Mild wings with fries and a pc of bread only $11. B Wild wings and Wing-stop AIN’T got nothing ON Harold’s! Street parking in front. No frills type of place hence the word SHACK in its name. Thank you Harold’s #13",
        "I saw the harolds truck on my way home and i really thought it was the one from 87th street ,but i was informed it was from this location; no problem i will give them a try.  The chicken was all right but the sauce didnt taste like harold's sauce.  i definitely won't be ordering from this truck again.",
        "Harold’s Chicken Shack #13 is a must-visit for classic Chicago fried chicken! I tried their hot wings and they were perfectly crispy, juicy, and packed with flavor. The sides, especially the mac and cheese, were creamy and delicious, making the meal even better. The staff were friendly and quick, even during a busy lunch rush. A true neighborhood favorite for anyone craving authentic, hearty fried chicken!",
        "Purchased a wing and gizzard combo. They lady took my order was very nice ,but the food was terrible im upset because these gizzards was plain and cooked twice . Just look at the picture . If I was tired I would take this back.  I basically paid $12 for 3 wings and fries because I was not eating the gizzards .",
        "I ordered uber eats delivery and it was disgusting. My wings were not fresh and my order was wrong. I had one 5piece wing and a 4piece. Both did not have lemon pepper on them and they also were not fried hard. Will not be ordering from this location at all."
      ]
    },
    {
      "name": "Harold's Chicken Avondale",
      "address": "3517 N Spaulding Ave, Chicago, IL 60618, USA",
      "neighborhood": "Chicago",
      "lat": 41.945339,
      "lng": -87.7088929,
      "rating": 4,
      "reviewCount": 10,
      "reviews": [
        "Harold’s Chicken Avondale is the perfect spot for chicken wings. Arguably the best chicken restaurant in Picnic Digital Food Court. We order the 8 Piece Wings, Large Fries, and Mild sauce. The chicken was cooked up quickly and was both crispy and flavorful! We will be back for more soon!",
        "I genuinely tried to give the new Harold’s in Avondale a fair chance. I’ve been eating Harold’s from different locations across Chicago for over 20 years, so I know the classic Harold’s flavor, texture, and quality. Even after seeing the string of 1-star reviews, we still placed an order—mainly because the Harold’s on Milwaukee & Wood wasn’t taking orders that day.\nWe ordered from UberEats two 6-piece wings with black pepper on everything, plus mild and hot sauce on the side, using the Buy 1 Get 1 Free promotion. Somehow, all four trays were disappointing. The chicken was dark, bitter, and tasted like it had been fried in old grease. The crust was extremely hard—more like it had been cooked earlier, left sitting around, and then dropped back in the fryer. Nothing about it tasted fresh, or even close to the Harold’s standard I’ve known for two decades.\n\nWhat really made me shake my head is that most Harold’s locations proudly display the famous sign: “All orders cooked fresh to order — 20 minutes or more.” It’s practically a Harold’s cultural landmark at this point. But this location must have reinvented the slogan, because nothing in our order tasted “fresh to order.” If anything, it tasted more like “sat for 20 minutes or more” before being reheated.\n\nI took photos because the difference between this batch and what real Harold’s should look like is night and day. As someone who has eaten Harold’s consistently for 20+ years, this was one of the most disappointing Harold’s experiences I’ve ever had. I really hope the quality improves, because Avondale deserves better than four trays of overcooked, stale-tasting wings.",
        "Located in a digital food court, but very easy to order and pick-up. The chicken and fish were both FRESH and Flavorful.\n\nOne of the best in terms of taste and convenience in the area.\n\nI’ve tried their wings and catfish on two separate occasions and both have great portion sizes and follow the original recipe to curb the Harold’s cravings.",
        "I just ordered food requesting for the sauce on the side.. instead they completely ignored my request and the sauce altogether. This is my first time experiencing Harold’s Chicken and I’ve missed the supposedly best part.. the sauce. Chicken is good but super disappointed. Please check your order if you decide to order from this spot.",
        "The tenders and fries were fresh and perfectly seasoned OMG. They’re not stingy with the sauce either! 100000/10, thank you for bringing good chicken to the north side!"
      ]
    },
    {
      "name": "Harold's Chicken Shack #52",
      "address": "7200 S Western Ave, Chicago, IL 60636, USA",
      "neighborhood": "Englewood",
      "lat": 41.7627387,
      "lng": -87.68363,
      "rating": 3.9,
      "reviewCount": 514,
      "reviews": [
        "It's says y'all closes at 1pm... I walk in @12:22 on a Saturday and the guy frying the chicken says we're done. While he is frying chicken... I live around the corner... And come here often... But this blew my mind that your door is open and I can walk in but you stop cooking 38 minutes early.... I will not come back.... To be honest they don't deserve my money. Anymore...",
        "🗣🗣🗣 This Harold's right here in this gas station is DELICIOUS!!  Since the angry lady is gone, the phones are even being answered 🙌🏾🙌🏾🙌🏾. My chicken was freshly prepared,  and just the way I ordered it! If you're looking for a GREAT meal,  this is the location to go to.\n\nMy last experience at Harold's was on 35th and Indiana 👎🏾 STRAIGHT TRASH. Don't even waste your money.",
        "I love this Harold's location! For $20, you can feed 2-4 ppl. I always order two halves of dark, and they give a 2 piece free. That's 10pcs chicken, 6 slices bread, 3 coleslaw minis, and 3 servings of fries. It works!  when you're in a hurry and on a tight budget not to mention the food is fire!!!",
        "Tried this location on the fly- food was very very tasty! Everything was fresh! But my friend told me they forgot my pepper, but first time here was a hit!!! Loved every bit of my 6 wings with fries!!! Will definitely return, please keep up the good work!",
        "I asked the cashier can I buy another boat that they use to put the food in because I had ordered a 8 piece with mild sauce and salt and pepper on the fry’s and just extra extra lemon pepper on the chicken she said NO don’t no why I don’t like how they stack their chicken on top of their fry’s and just pull mild sauce over everything by the time I make it home I have soggy chicken and I love crispy chicken crazy"
      ]
    },
    {
      "name": "Harold's Chicken Shack",
      "address": "8738 S Kedzie Ave, Evergreen Park, IL 60805, USA",
      "neighborhood": "Chicago",
      "lat": 41.73407,
      "lng": -87.702696,
      "rating": 3.6,
      "reviewCount": 852,
      "reviews": [
        "Cashier has bad attitudes and I waited 45mins for my order rib tips and after asking about why it took a long time \"fheir putting the sauce on it and that took 10mins.\nWhile I was standing at the counter watching and waiting I couldn't help but see the\" Bottle of Patron\" being distributed.  SERVICE TERRIBLE !!!\nThe rib tips okay sauce greasy",
        "This is a sleeper Harolds. Not too many people realize how good this location is which is great because not as crowded as some of the other Harolds. When you tell them fried hard they fry your chicken hard. Would give them 5 stars but they still only doing cash payments which is old school but the food here is great.",
        "This restaurant by the edible arrangement by 87th & Kedzie was horrible. My family is sick because the worker didn't \"feel\" like taking our order so the chicken was half done and the sauce was not portioned right on the ENTIRE MEAL. I don't usually leave these reviews but if you don't like your job find a new one. This is a business. Leave your \"feelings\" at the door or go to therapy. One of the WORST $55 I spent. I do not recommend going here at all. In stead of opening more franchises let's train on customer service and company value. Have a good one. Oh and I want a refund as well!",
        "Every time we stop by at the Dunkin donuts next door we're always saying we're going to try this place. We ordered a 8 piece mixed with lemon pepper and hot sauce on the side. We waited about 30 minutes for the food which for me I think it's excessive for an 8 piece. Chicken was descent enough for me to want to order again but next time I will order ahead of time.",
        "Food is always so good and fresh !!! The cook deserves a hug !!! You can tell he takes his time with cooking the food and it’s exactly like how you ask for it ….. The cashiers are always so NICE. And professional . BEST one hands down !!!!"
      ]
    },
    {
      "name": "Harold's Chicken & Famliy",
      "address": "700 E 100th Pl, Chicago, IL 60628, USA",
      "neighborhood": "Roseland",
      "lat": 41.7126009,
      "lng": -87.60513510000001,
      "rating": 4.3,
      "reviewCount": 240,
      "reviews": [
        "Food is very good here it's my go to place now for Harold's Chicken the best on the Southeast of Chicago on 98th and Torrence. The service is wonderful very polite not just saying this , if it wasn't I would say so. Theresa Jackson",
        "If it were not for the couple chicken wings that didn't really look like wings, the food is great! I bought an 8 Wing but only 6 of them were completely edible. Those 6 wings though were cooked to perfection. Seasoned just right. I wish all plates looked like a plate they would personally eat.",
        "Every time I come in here I have  a good experience! Just moved back to the city And initially was not coming here due to the location of it. I just so happened to come one day and I’m so happy I did. It’s an older lady in here. She’s extremely nice and always welcoming. When I come here, I come for two and sometimes three different houses. My food is always fresh and fast. So proud of my Black people💪🏾💕💕 Woord of advice, order online",
        "Food was on point. You get everything you are supposed to get for a wing dinner. (Chicken, crinkle fries, bread and coleslaw) They put a good amount of sauce nothing is left dry. Chicken was fresh! Excellent portion size. I will be returning. Also exceptional customer service. Thank you for doing order number 34 on 9/7/25 the way it’s supposed to be done! I will be back. Compliments to you all, I felt like family.",
        "To Management …THANK YOU! I’m back for an update on this location because they truly deserve it! My last review was not as positive but I am glad to say that I have been back to this location two times since my first review and it seems like management made some great changes and I personally appreciate it.. a different set of staff that delivers a much better experience… I only get the catfish so far and it is consistently delicious. I’m grateful that I don’t have to always go outside of my community to get the great food experience I deserve!"
      ]
    },
    {
      "name": "Harold's Chicken Shack",
      "address": "808 E 79th St, Chicago, IL 60619, USA",
      "neighborhood": "Chatham",
      "lat": 41.75141319999999,
      "lng": -87.6047396,
      "rating": 3.5,
      "reviewCount": 652,
      "reviews": [
        "3 wings was 7.71 they told me 8 dollars even which is not a big difference yet prices went up. He told me I might as well get a 4 piece for 10 dollars when the menu states 8.50. They are always late with food and never give lemon pepper. Paid the 10 for my 4 wings. ❤️ I just won’t be back nor refer this location to anyone again.",
        "They love to sale recooked rib tips! And don’t answer the phone,so you can’t even tell them about your order. Only thing fresh was the fries and they was under cooked smh.",
        "I had a late night craving for Harold’s and this hit the spot 🔥 I like how they add seasoning to the fries, I haven’t seen that at other Harold’s. The men working there were nice too",
        "The chicken batter is so properly seasoned the lemon pepper has has this sweet but lemony salty savory. It’s so good and you have to get the mild sauce on it get the mild sauce. I’m so sorry I don’t have any photos. It’s like the moment I got the chicken and got in the car. I literally inhaled it while I was driving back to my hotel room, so Harold do y’all thing.",
        "This was the worst Harolds I ever ever had\nThe chicken didn't taste like Harolds it tasted like I cooked it at home. The breast was super large and dry\nThe mild sauce on the fries was totally different than the mild sause I was given on the side. I wish I could upload the order I trashed and wasted $ on. I will not use Uber eats again it wouldn't say the address of the harolds BC I would have never ordered from that store. Maybe that's why they don't t\nhave a number attached to their store\nBEWARE!!!!!!"
      ]
    },
    {
      "name": "Harold's Chicken Shack",
      "address": "9151 S Ashland Ave, Chicago, IL 60620, USA",
      "neighborhood": "Auburn Gresham",
      "lat": 41.7269865,
      "lng": -87.6624969,
      "rating": 3.6,
      "reviewCount": 693,
      "reviews": [
        "When I placed my order the cook was distracted by a phone call about his family members in Danville and selling their furniture. While listening to his call and the wait time for my order, I knew my order would be wrong!!! The woman that worked the register asked him what was the order in front of her and he said gizzard and wing combo. She informed him that it was a large gizzard and 6 wings he told her to just take the wings off!!! None the less my large gizzard is now a small gizzard I wanted them fried soft and they are hard as bricks…. The cook had the nerve to open the door to tell me that a large gizzard come in a combo. No refunds and no recooking even if they messed up your order!!!!! Used to be my favorite but, I’m never going back!!!!",
        "I used to be a Harold's chicken addict. I could tell you which chicken shack had the best chicken, which one had the best gizzards. This chicken shack food I ordered on 5/5/25 was terrible. I should have had tacos. I ordered the chicken and gizzard combo with mild sauce. I was told 15 mins the food would be ready. When I got to my destination and opened the bag. I didn't know if they gave me a chicken or a Cornish hen wing. The wings were so small. The fries were half sized. My friend asked me,'Did they have any whole french fries?' I laughed. The gizzards were just ok. The two wings on the picture made its way to the garbage, along with some fries and gizzards. I don't have to return to this location. I know a bar that sells chicken wings and gizzards MUCH better than this Harold's.",
        "My people we got to do better, lets not say we cook to order and refry the same wings you cooked this morning. I paid for 40 bucks for 16 wings and 2 hot peppers, I should’ve checked my food but I was so hungry that I was ready to go home and eat. Got to my location and they had given me some old chicken. To top it off the lady who took my order was outside smoking a cigarette and didn’t wash her hands when she returned. Luckily someone else came in and packed my chicken. This experience has been a first for this location but unfortunately I will not be patronizing this location ever again. Please do better Harold’s chicken #4",
        "Me and my grandmother have eaten their chicken 2-3 times now. The best Harold's I've had in years for sure!",
        "My Daughter said this place just reopened and they are REALLY GOOD. I stopped In after work today I placed an order @4:49pm for a 1/2 Reg Salt & Pepper Only.  At 5:17pm I got my food went to the car checked my order it was Loaded With Mild Sauce.. I took it back told them I have the wrong order they told me their ticket has mild sauce on it.  I showed the guy my Receipt that showed Salt & Pepper Only. They apologized and cooked me a new order unfortunately I didn't leave until 5:48= 1 Hour for food that had No Flavor. I was not Happy I don't think I'll be going back. I only waited b/c my Daughter said Mom it's gonna be Good NOT SO MUCH!!!\nMz.Sand"
      ]
    },
    {
      "name": "Harold’s Chicken & Sports Bar",
      "address": "16200 S Cicero Ave, Oak Forest, IL 60452, USA",
      "neighborhood": "Chicago",
      "lat": 41.5976396,
      "lng": -87.73654010000001,
      "rating": 4.1,
      "reviewCount": 178,
      "reviews": [
        "The food was great! This is an actual Harold's Chicken Shack. They had a special of buy 6 wings get 6 wings free. They also serve drinks. I've been there before and the drinks weren't that good. This time the drinks were good. This is the best Harold's in this area.",
        "Let me add this to the review.  On the menu they specifically say that it includes coleslaw.  I love coleslaw with barbecue.  I have never received coleslaw in my order at any time. I have been there.  This last time I did ask for coleslaw and I wanted them to make sure it was in my order.  It was not in my order.  If you want coleslaw make sure you ask for it and make sure they put it in there before you leave.  On the other hand, everything is fantastic. The chicken is awesome.  The service is great.  They cook it when you order.  Don't forget to ask for lunch specials if you're here before 2:00 pm.  The atmosphere here is great.  If you wish to dine in all the chairs are tall.  They have a mini slot machine section, make sure you're 21 if you use it.  The chicken is awesome!",
        "Went to watch the Ravens and Green Bay game. Its a sports bar with no sports. The staff were kind. Ordered 6 wings to go instead, cost $14.29, took about 15 minutes. Fried and flavored very well! Feather included. Not bad or good just blah.",
        "I enjoyed this spot the food was good all but the cole slaw.The service was good, however you can tell that he was overwhelmed. Because he had to handle the Uber eats and customer before him..\n\nNow the music is a good idea however it was loud.We had to talk over the music and they were playing a lot of  unedited music. Which was a little much for me.I  love the idea of what they are trying to promote. Yes this could be a nice after work spot or even a birthday party space.\n\nInvest in your business hire a extra help especially when it's football season you will attract more people of older age and maybe Sunday nights can be a old school night just before you getting ready to start the new week. Overall this Harold's Chicken has great potential of making a whole lot of money with  just with a few changes.",
        "We threw a surprise bday party here on 7/12/25 and a time was had! The food was excellent, the service phenomenal and the atmosphere felt like home. We had a really great time. I appreciate all of the hard work the staff performed to make the party as great as it was. The ladies on the bar were on point and made sure everyone was served efficiently. Everyone was so nice and fun to work with. Thanks again!!!"
      ]
    },
    {
      "name": "Harold’s Chicken",
      "address": "1711 E 87th St, Chicago, IL 60617, USA",
      "neighborhood": "South Chicago",
      "lat": 41.7367644,
      "lng": -87.582206,
      "rating": 3.3,
      "reviewCount": 331,
      "reviews": [
        "If you like your food fresh don't be fooled by the $1 wing special. To get what you pay for! I rather pay more and waiting longer for better quality food. I should have known when I didn't smell the food being cooked and couldn't see any staff or the cashier. Every order was 10 mins.",
        "I came in yesterday on a Friday night, my first-time & requested a half dark chicken with lemon pepper & 2 cans of soda which I ordered separately. I offered my condolences regarding the 55 year old female owner passing...the older female cashier working responded that she didn't know in a nonchalant manner & not a thank U on behalf of the company. I'm like wow... When I got my food 15 mins. later my food was salty with lemon pepper & it didn't even taste like Harold's Chicken either.",
        "The chicken is fresh. I met the owner while I was there, and he was nice and professional.  He takes pride in his restaurant being clean and chicken fresh. It is in a somewhat sketchy neighborhood. However,  it's worth the trip.",
        "I ordered a large gizzard and was extremely disappointed! The gizzards were awful! They had absolutely no taste, very small and hard, no seasoning! Harolds use to have a distinctive taste not these!",
        "I ordered a 10 piece with lots of  sauce. They asked me if I wanted lemon pepper I said yes please. I pulled off and I opened up my bag and I saw that there was just a tiny squeeze of sauce on my chicken. That’s the whole reason of going to Harold’s is to get the sauce and there was absolutely no lemon pepper. Why even ask if you’re not going to put it on there highly disappointed, highly dissatisfied want my money back. Place looks very random down and terrible and the inside"
      ]
    },
    {
      "name": "Harold's Chicken Shack Evanston",
      "address": "337 W Howard St, Evanston, IL 60202, USA",
      "neighborhood": "Chicago",
      "lat": 42.01955030000001,
      "lng": -87.67447539999999,
      "rating": 3.1,
      "reviewCount": 427,
      "reviews": [
        "I don't eat takeout nearly as much as I did pre-COVID so I'm not ordering from here as much. But when I do get a craving for takeout (usually no more than once a month), Harold's French fries with mild sauce and fried mushrooms is often what I want. I ordered from here yesterday, and per usual, these two items did not disappoint.\n\nI've been inside of here MANY times. I like it. I didn't always see people wearing masks during COVID-19, but the one lady (sorta long bob with highlights, I think) who called everybody \"sweetie/sweetheart\" was so pleasant that I let it slide. I don't know where she is now. I've seen two other women post-COVID who look like they'd rather be anywhere else, but I liked THAT lady. She was the epitome of good vibes. All the guys I've encountered were friendly too. One gave me the nickname \"Sides\" because he caught on that I never order chicken or fish. (Vegetarian.) I haven't seen him in a long time either.\n\nI would normally give this place 5 stars for the fries, mushrooms and those two, but I ordered cheese sticks that were clearly not cooked. The cheese was cold. The breaded part was lukewarm. It tasted like somebody defrosted them and just put them in the bag. I've gotten cheese sticks from there a number of times, and they were always coked well. Getting marinara sauce was only about 10% of the time though. They are always out.\n\nThat's the only reason I'm knocking a couple of stars off. I've yet to figure out how to make fried mushrooms as perfectly as they do. I've tried and failed, and then I order from the experts. So, it's not always perfect in there but I still like it.",
        "First time here and everything was good from the service to the food !! If you’re familiar with Harold’s you already know that EACH one is different. This one was good . I got a 4 wing dinner with hot sauce on everything. My only slight issue was coleslaw was a little juicy but still good !! If you’re in the area I would suggest stopping by .",
        "Canadian here. Heard great things about Harold’s. :(\nThe chicken was salty. :( the liver was very livery (but i dont like liver so my 3 stars are just for the chicken and fries and cat fish) the fries were food. The cat fish I enjoyed!\nIt took about 30+ minutes to get our food….. i drove there.( which i didnt understand since doordash says you get it in 10?)\nThe person who took our order was friendly and helpful.\n😢",
        "Everyone always talks about Harold’s Chicken! So I wanted to check them out for myself. I went with some friends to finally check them out. And I ordered the 6 piece chicken wings with mild sauce and a 4 piece chicken wing with lemon pepper. I requested that the wings be fried hard, and the wings were pretty good. I tried the French Fries. They were just okay. But overall I’m glad I went . The wings were tasty!!",
        "I grew up on Harold's Chicken. It is a continued favorite in my family. However, today's order at the Evanston Howard location was an unfortunate dining experience. The Cook was half an hour late. Once, I finally got my 6 wings and fries, one of the wings was completely black!  Not burnt, but BLACK!! Looked dangerous and or diseased! This took all the joy away. from enjoying the rest of my meal. I also want to mention that the nice young lady who took my order and seasoned my food was GREAT! I didn't take back the BLACK wing bc ( let's face it) I am sure they would not have provided a customer friendly remedy. This is verified by all the handwritten signs they have posted in the restaurant (i.e. check your food before you leave...). I was not happy with this visit. If there is a next visit, I will open the bag and check every EVERYTHING!!! I am sadden it has come down to this!!"
      ]
    },
    {
      "name": "Harold's Chicken Shack #50",
      "address": "1537 Western Ave, Chicago Heights, IL 60411, USA",
      "neighborhood": "Chicago",
      "lat": 41.502809,
      "lng": -87.6737741,
      "rating": 3.1,
      "reviewCount": 380,
      "reviews": [
        "Gizzards slightly undercooked. Service was ok, kinda on the fence may give them another try and tell them to fry hard.",
        "Cashier was rude. She made you not even want to order nothing. The wait was said to be 15 mins.. turned into 45 seemed like they prioritize doordash orders over walk in orders.  Asked for my chicken and gizzards to be fried soft with mild sauce and black pepper there was literally 2 drops of mild sauce for the entire order.  10/10 WOULD NOT RECOMMEND‼️",
        "They always have the pickup orders ready to go on time. Thank you this I don’t mind waiting but time is money. No issues with items missing.",
        "I had the pleasure of giving this Harold’s a try today. I was skeptical because of the older reviews but once I saw that it was under new management I decided to give it a try and I’m glad I did! I was completely impressed with the customer service. From the phone call where I placed my order to my service when I picked it up was wonderful. They were cheerful and eager to assist. Baby then I got home and tried my food! It was Hot and Fresh, The sauce was right and My order was correct! 👏🏾👏🏾👏🏾 You guys definitely gained a new customer out of me. Thank you again!",
        "The employees are playing around and making fun of you from the kitchen. They have you ringing the service bell, and they just laugh and make mocking comments."
      ]
    },
    {
      "name": "Harold's Chicken Shack",
      "address": "13653 S Cicero Ave, Crestwood, IL 60445, USA",
      "neighborhood": "Chicago",
      "lat": 41.6440528,
      "lng": -87.7373965,
      "rating": 3.6,
      "reviewCount": 616,
      "reviews": [
        "My friends and I visit this location on 10/25/25. Great service from Jamie if I remember that was the bartender/server name. She was 100% awesome the only bartender there. Everything was going great DJ awesome and all. We had been there for about 1 hour or 2 before the cook walked off the job before fulfilling the entire party food order. Jamie didnt show any sign of stress she kept it together and kept apologizing the other guy(comedian)forgot his name was a big help. The security guard stepped in as well, the all kept my friends and myself informed and called in someone to come finish cooking for us whom never received our order. Our food wasn't as pleasant as our other friends but they tried their best to keep us satisfied. I just wanna thank Jamie and the rest of the crew for keeping it professional while keeping us all satisfied❤️see you on 11/15 Jamie & Crew",
        "Cashier don’t pay attention always on the phone and charge me the regular price for a 4 wings which it suppose to be the lunch special price of $6.99 regular price $9.29\nThen somebody she knows comes in and order the 4wings and she gave him the special price …. Four wings special from 10:30a til 1:30pm\n\n1/13 date\n12:15pm time\n\nDo better customer service",
        "Ordered two orders of there chicken nuggets and fries. However they did not add fries. Also ordered 10 wings and fries. Literally gave me 10 fries. It’s best to go to another Harold’s location.",
        "Good food and drinks are always Fye!!! The atmosphere is always a vibe😍 The staff is friendly and it’s always a vibe when I come.",
        "I called in my order and the cashier said 20 mins. When I got there I still had to wait and when I got home there was NO sauce on my chicken when I specifically said “salt, pepper, and mild”. The fries are not good, but the chicken was fresh. They need to do better and READ."
      ]
    },
    {
      "name": "Harold's Chicken Shack",
      "address": "15411 Cottage Grove Ave, Dolton, IL 60419, USA",
      "neighborhood": "Chicago",
      "lat": 41.6148803,
      "lng": -87.596341,
      "rating": 3.2,
      "reviewCount": 148,
      "reviews": [
        "Ordered through Uber eats on a Wednesday at 12:00 pm. (2) 1/2 dark specials and (1) 1/2 white. First off, it was a plain white bag…no Harold’s original bag. The food arrived hot and the sauce was evenly spread, but the meat did not taste right. It was very very tough and not fried hard like I asked. I thought I was ordering from 127th and halsted. Never will eat here again.",
        "I went to Harold’s in Dolton today to pick up an online order.  The lady behind the counter was rude and rolling her eyes. I told her Thank you and she never responded. Rolled her eyes and walked away.  I will not be going back to this Harold's.",
        "Chicken was dark like it was cooked in bad grease. As a matter of fact I’m sure it was.. Straight up nasty… You guys should be ashamed of yourselves.. This is Not a Real Harold’s…someone should report this to corporate!",
        "I rarely give 5 stars. But I have to give them their credit ! I got 6 wings with EXTRA mild sauce ( true Chicagoan) and it was amazing. It was so fresh and the mild sauce was perfect. Very impressed also that I ordered it from Uber eats and it was still very hot.",
        "The food was hot but it definitely doesn't taste like \"harolds\" definitely don't recommend this location."
      ]
    },
    {
      "name": "Harold's Chicken",
      "address": "11817 S Pulaski Rd, Alsip, IL 60803, USA",
      "neighborhood": "Chicago",
      "lat": 41.6780887,
      "lng": -87.7193108,
      "rating": 3.4,
      "reviewCount": 457,
      "reviews": [
        "am so glad this location opened up—it’s great to have them relatively close! While the wait for food can be longer than at some of the less desirable spots nearby, the quality makes it well worth it. The chicken is consistently fresh, hot, and delicious. It’s definitely a Southwest Side gem!",
        "First time I had ever gone inside this business, 2 patrons were watching a football game on the business TV. The cashier told me my food would be about another 5 minutes. Food was tasty. Packing lot is small.",
        "This is my favorite spot- it’s clean and everything is super fresh. Inside is super clean. I usually call ahead to order and it’s ready within 15-20 minutes. Small/shared parking lot, but what I love about this spot is it has a DRIVE THRU so I can pull up when the food is ready! Kayla is super friendly and professional. Always coming here!!",
        "Dec.5 2025 I've been patronizing this place ever since it's been open. I deleted my five star. I come there once or twice a week after work phone order person is rude and this is not the first time. I ordered a 10 wing with light sauce chicken was not freshly cooked and old fries with just a few drops of barbecue sauce on it. Will not be patronizing anymore.",
        "We experienced poor customer service. Cashier was very rude both over the phone and in person. We placed our order by phone but still had to wait about 20 minutes after arriving to pick it up. I had requested extra sauce, but there was barely any on my food. When I asked for more, the employee insisted it was already in the bag — however, there was no sauce in the bag at all. This was disappointing and not the level of service we expected."
      ]
    },
    {
      "name": "Harold's Chicken Shack",
      "address": "4527 Lincoln Hwy, Matteson, IL 60443, USA",
      "neighborhood": "Chicago",
      "lat": 41.50527779999999,
      "lng": -87.72555559999999,
      "rating": 3.5,
      "reviewCount": 741,
      "reviews": [
        "Waiting area was clean and orderly. Has a few seats. Food was great! Wings were cooked just right. Ask for extra sauce if you're getting it on the side. Service was good but the cashier was a little slow. But it was a Friday night. Highly recommended!",
        "Came in at 8pm on Saturday it was not busy employees were very nice, but they had a fryer full of chicken and a fryer of fries. With it being not busy was unsure of how fresh the food would be ordered a fresh order cook was nice and didn’t have a problem. But he did not change his gloves when starting the order, that was a turn off.\nRestraint looks clean on inside customer side but needs to be deep cleaned and repainted in the cooking area another big turn off. So I just canceled my order and went to the one on Cicero and 163rd",
        "The call in order took an additional 20 minutes waiting time after paying for your food while other call in orders that was paid after me walked in and walked rite out with their food. Plus they didn't put any of the sauces in the bag and the lady waitress walked around as if it wasn't any customers at the counter never said hello to nobody just rude.",
        "It’s sad, that l stayed on hold and had to hang up because the person picking up the food got there before they took my order. And when she got there, it wasn’t busy. She ordered the food well done,  and the fries were literally raw. Apparently they were in the fryer for a short time. The price of food is too expensive for bad service and bad food. So sad!!!",
        "I went in here being very nice.  I’m very particular about my food i watched them doing wrong when they put sauce all over my food when I asked for it on the side.  I let that slide still being nice I asked the girl taking my order at the time if she can give me a pop because they were doing wrong she said no, we don’t give nothing free.  When I get get home it’s lemon pepper all over my food in which I didn’t ask for.  I called the manager and he was very dismissive even thru my niceness he had no answers and hung up on me.  Again I was respectful and nice the whole time."
      ]
    },
    {
      "name": "Harold's Chicken On Clinton",
      "address": "115 S Clinton St, Chicago, IL 60661, USA",
      "neighborhood": "Chicago",
      "lat": 41.8800367,
      "lng": -87.6409645,
      "rating": 2.4,
      "reviewCount": 29,
      "reviews": [
        "Outstanding service.  The Chicken is always piping hot and fresh.  Ordering takes about 15 minutes.  They have also set up cameras so you can see your meal being prepared.  I will never again go to another chicken place in the area.  They also have lunch specials from 10am-4pm, Monday through Saturday.",
        "this place is CLOSED...idk why Google still has it listed",
        "worst experience ever. long wait, bland dry chicken, somewhat over cooked, no sides of sauce so the tiny bit they put on was it, which you didn’t get any flavor from, and the long wait was fine until it seemed our food had been sitting for quite awhile before we got it. was recommended from someone who used to live in chicago but that was the worst chicken spot experience i’ve ever had.",
        "It's shut down. Don't waste your time",
        "Very good. Ordered the 1/4 white dinner and food was fried to perfection and the restaurant was clean. Will return after Lent."
      ]
    },
    {
      "name": "Harold's Chicken shack",
      "address": "1126 S Grand Ave E, Springfield, IL 62703, USA",
      "neighborhood": "Chicago",
      "lat": 39.7869733,
      "lng": -89.64031469999999,
      "rating": 3.7,
      "reviewCount": 108,
      "reviews": [
        "Update 5 stars to 2: After almost 2 months in operation this restaurant has been came a typical Springfield restaurant. Serving cold food, incorrect orders at a rate of 50% to 75% and non-existent customer service.  They put hot meat on top of cold fries. They constantly do not put sauce on orders. Sauce on and sauce on the side are 2 different products, adding sauce afterward does not create the same chemical reaction. On my last visit I waited over 40 minutes for my food because they made a mistake in the back and gave my food to another customer. You can hear EVERY SINGLE THING they say in the back. I stood there and listened to them give my food away. Then give me cold fries after waiting 40 minutes while they are counting down to closing time an hour before close.\n\nFinally the taste of the mild sauce and the season of the chicken is starting to vary wildly.\n\nI have called and spoke to management before, they don't care. Check your order before you leave and make hope the \"good\" cook is on duty.\n\nOriginal review :\nThis Harold's is exactly what you would get in the city. As good as 87th, made correctly unlike Hyde Park. Everything is seasoned and cooked perfectly. The wait is long because of COVID but they seem to be improving the process. They aren't taking call in orders which really sucks but I understand. This is probably the best thing to happen to Springfield in 2020. If you love Harold's, don't hesitate to visit.",
        "Don’t go here! They will charge you $1.50 for extra mild sauce but don’t put any extra mild sauce on there. I ordered 10 wings with heavy mild sauce. 5 wings had some sauce on there and the others had NO sauce on there. The owner stated she will not refund my money because I didn’t call until the next morning or return the food. I didn’t get my food until almost 9 pm last night and called about it this morning AFTER I realize I was charged for extra sauce  that I didn’t receive.\n\nThe owned is getting over on customers over charging them maybe because she’s in a financial hardship but that isn’t my fault nor concern. I will not be returning to this rip off restaurant and I will be getting my money BACK!",
        "By far the best chicken wings I’ve had in Springfield, combined with the hot sauce and lemon pepper seasoning it made for a great lunch. The food was priced greatly as well. It was empty when I came and ordered which is a shame considering the quality of the food. The community should rally around spots like these before all we’re left with are McDonald’s and burger kings on every corner.",
        "I was craving some hometown food and found this Harold’s. I went inside to order and the food was very reasonable but as I sat outside to wait on my food I started reading reviews, upon doing that I noticed a lot of comments of food not being hot which mines was hot, I seen reviews about chicken being dark fried to hard like it was in dirty grease and it definitely looked like it was fried in dirty grease. The catfish combo said 4 piece and I’m thinking I’m getting 4 pieces of fish and it was like 4 fish tenders and the fries was cooked hard and the sauce didn’t taste original. It was a total disappointment and I wouldn’t recommend going here. If you’re going to buy into a franchise at least try and keep up the quality of food to match with the name you’re using.",
        "I went in tonight after a very long day. I must say many bad moments interrupted my day so I was pretty down going to get food for the family. Big John and Rico were very welcoming, professional and clean. I noticed John and Rico was their hands a few times and they had on masks. We enjoyed the food and I enjoyed the experience. Keep it up y’all. It’s the little things that can make one’s day/night just a little better.\nThank y’all. Oh yeah and the presentation of the food…on point 👌🏿"
      ]
    }
  ]
}