{
  "lastUpdated": "2026-02-05T19:59:09.467Z",
  "locations": [
    {
      "name": "Harold's Chicken Shack #1",
      "address": "503 E 47th St, Chicago, IL 60653, USA",
      "neighborhood": "Bronzeville",
      "lat": 41.8092139,
      "lng": -87.613624,
      "rating": 3,
      "reviewCount": 143,
      "reviews": [
        "Affordable and delicious!  I don’t get to Chicago much anymore but when I do, Bronzeville Gap Harold’s is our go-to for freshly fried Fried Chicken with hot sauce on wonder bread!  Perfection every time!  And I’m able to grab a bottle of hot sauce to go!",
        "This place is absolutely terrible. The food, pricing, customer service, and even the location—all awful. We called in an order for the 10-piece wing special with lemon pepper seasoning on the wings and mild sauce on the side. We were told it would be ready in 20 minutes. When we arrived, not only was the food not ready, they were just dropping the fries. When we finally got home, we realized they didn’t include the mild sauce at all. The fries were undercooked, and the lemon pepper seasoning was dumped unevenly in one spot on the wings. We called to let them know about the issues, and the man on the phone was argumentative instead of apologetic. We paid over $21 for 10 poorly made wings and honestly, it was a complete waste. They’ll never get another dollar from me.",
        "I called several times to place an order and never got an answer…. Went there and there were only two people in there and both had already ordered…. I stood at the window for ten minutes and the girl who was taking the order never came to the window….. instead she decided to play music in the back…. I stood there and called the number to see if they would pick up… I never heard a phone ring…. The man who was cooking in the back was standing up nodding…. The girl pulled a cover so we couldn’t see…. I walked out of the place…. I do not recommend this Harolds",
        "Not only are you not open on a Thursday afternoon at 2pm, as I’m reading the reviews the owner responds to a customer by downplaying another Harold’s smh.. As a business owner that’s nasty work do better🤮",
        "I’ve enjoying the wonderful flavors of Harold’s since I was a child like most Chicagoans, and over the years the taste has changed, but this location definitely takes me back to the good ole days! The owners are always striving to make every bite your best! The food is always fresh, the sauce is perfect and when you say fried hard, that’s exactly what you get! Probably my new favorite location!"
      ]
    },
    {
      "name": "Harold's Chicken #2",
      "address": "Kimbark Plaza Parking Lot, 1208 E 53rd St, Chicago, IL 60615, USA",
      "neighborhood": "Woodlawn",
      "lat": 41.8000542,
      "lng": -87.5960602,
      "rating": 3.6,
      "reviewCount": 950,
      "reviews": [
        "Great tasting chicken but, damn do the employees have to pay for sauce out of pocket? This chicken is way too dry for the price!! Also, if you ask for more sauce they force you to buy extra in a cup which is not the same and defeats the purpose of adding sauce while the food is hot! I’m giving a 1 star because, this is not how original Harold’s is served!",
        "Normally I can order my food and pick it up without a problem but today when I went to pick up my order, I tried to tell one of the women, looks to be in her 40s, that I made an order and when I said my name, she ignored me and started calling numbers from 62 to 67, and then another woman walks up and said she called in an order, now another woman in the back gets her food and I’m trying to get mine after her but the older woman just calling numbers, still ignoring me. I finally tell the younger woman I ordered through grub hub and I tell her my name like I told the other woman and she gets my food for me. I don’t know what the older lady’s problem was but she needs to get better customer service skills or stop working the register. It doesn’t take a lot just to learn to listen  and stop ignoring people especially when they’re not disrespectful. I won’t be coming back here ever again.",
        "I purchased 5 wings and they were pretty decent but the fries were hard, dry, and some what soggy. Can't eat chicken from harolds if fries not right. Places since Covid have really went down",
        "Not going to lie I gave up on this Harold’s years ago because the food quality and service had fallen off. But today I decided to give it another chance and ordered 15 wings. The line was long but they were moving people in and out quick. And honestly… they made a comeback. The chicken was fye, fresh, and crunchy just how I like it. Even my 5-year-old said Mama this chicken fye",
        "I ordered a fourth white with just lemon pepper I received what looked like a fried rat with a bunch of sauce ,this Harolds has went really down and when you try to call, they don’t pick up the phone. I wouldn’t recommend this place at all."
      ]
    },
    {
      "name": "Harold's Chicken Shack #3",
      "address": "7348 S Stony Island Ave, Chicago, IL 60649, USA",
      "neighborhood": "South Shore",
      "lat": 41.7611111,
      "lng": -87.5866667,
      "rating": 3.3,
      "reviewCount": 848,
      "reviews": [
        "I order from here a lot and tonight was my 1st time calling them to complain I was missing items and my fries was old and cold never did the person asked if I wanted to come get my missing items or replace my cold food but what took the cake was when the young lady stated I’ll tell the cook…. No compensate me AND BO LEMON PEPPER 😡😡",
        "I was in this Harolds on 12/12 2026 at 610pm. The young lady at the register was counting her drawer down. She never acknowledged me waiting to order.  But the part was when she walked away came back, walked away again and sat down on her phone and never said anything.  When I said excuse me, she came back to the window and said nothing, holding her phone. I walked out. My 11 year old son looked at me and said \"why are they so rude to people everytime we are in here. Then he said \"that lady was extra rude for no reason\". I hope the manager/owner reads this because she should not work with the public. We come here alot and the service has never be good ,but the food was fresh. I would never recommend this Harolds again.\nFormer customer:(",
        "I’ve been coming to this Harold’s for over 13 years, and year over year they’ve progressively gotten worse that’s ended them where they’re at currently - in the toilet. Their service is the worst part of the experience. In addition to lying about their wait times (often taking an additional 1.5 hours for 1 simple order), their actually employees are unpleasant, nonchalant and unprofessional. It’s disheartening to see a spot that was once able to be counted on for their punctuality and professionalism be ruined and turned into a disgrace to the Harold’s franchise.",
        "This location is horrible with poor customer service. I placed a DoorDash order for pickup and when I arrived I was told they didn’t have my order even after I showed them the confirmation. The man at the window was extremely rude and dismissive. I even said I would pay for the food again if he could just make it and he told me it’s not his issue and to take it up with DoorDash. I then left and called the store because DoorDash told me they spoke with them and the store told DoorDash they gave me my order. The young lady at this location who I spoke with on the phone was rude and cursed me out and said she didn’t “gaf about what I was talking about.” Terrible and they need to be shut down",
        "I had an awful experience with my first visit to Harolds Chicken last yr. So I was advised to try this location. It was amazing if there is one better than this i want to see it."
      ]
    },
    {
      "name": "Harold's Chicken #4",
      "address": "7200 S Western Ave, Chicago, IL 60636, USA",
      "neighborhood": "Chicago Lawn",
      "lat": 41.7627387,
      "lng": -87.68363,
      "rating": 3.9,
      "reviewCount": 514,
      "reviews": [
        "It's says y'all closes at 1pm... I walk in @12:22 on a Saturday and the guy frying the chicken says we're done. While he is frying chicken... I live around the corner... And come here often... But this blew my mind that your door is open and I can walk in but you stop cooking 38 minutes early.... I will not come back.... To be honest they don't deserve my money. Anymore...",
        "🗣🗣🗣 This Harold's right here in this gas station is DELICIOUS!!  Since the angry lady is gone, the phones are even being answered 🙌🏾🙌🏾🙌🏾. My chicken was freshly prepared,  and just the way I ordered it! If you're looking for a GREAT meal,  this is the location to go to.\n\nMy last experience at Harold's was on 35th and Indiana 👎🏾 STRAIGHT TRASH. Don't even waste your money.",
        "I love this Harold's location! For $20, you can feed 2-4 ppl. I always order two halves of dark, and they give a 2 piece free. That's 10pcs chicken, 6 slices bread, 3 coleslaw minis, and 3 servings of fries. It works!  when you're in a hurry and on a tight budget not to mention the food is fire!!!",
        "Tried this location on the fly- food was very very tasty! Everything was fresh! But my friend told me they forgot my pepper, but first time here was a hit!!! Loved every bit of my 6 wings with fries!!! Will definitely return, please keep up the good work!",
        "I asked the cashier can I buy another boat that they use to put the food in because I had ordered a 8 piece with mild sauce and salt and pepper on the fry’s and just extra extra lemon pepper on the chicken she said NO don’t no why I don’t like how they stack their chicken on top of their fry’s and just pull mild sauce over everything by the time I make it home I have soggy chicken and I love crispy chicken crazy"
      ]
    },
    {
      "name": "Harold's Chicken Shack #5",
      "address": "1711 E 87th St, Chicago, IL 60617, USA",
      "neighborhood": "Chatham",
      "lat": 41.7367644,
      "lng": -87.582206,
      "rating": 3.3,
      "reviewCount": 331,
      "reviews": [
        "If you like your food fresh don't be fooled by the $1 wing special. To get what you pay for! I rather pay more and waiting longer for better quality food. I should have known when I didn't smell the food being cooked and couldn't see any staff or the cashier. Every order was 10 mins.",
        "I came in yesterday on a Friday night, my first-time & requested a half dark chicken with lemon pepper & 2 cans of soda which I ordered separately. I offered my condolences regarding the 55 year old female owner passing...the older female cashier working responded that she didn't know in a nonchalant manner & not a thank U on behalf of the company. I'm like wow... When I got my food 15 mins. later my food was salty with lemon pepper & it didn't even taste like Harold's Chicken either.",
        "The chicken is fresh. I met the owner while I was there, and he was nice and professional.  He takes pride in his restaurant being clean and chicken fresh. It is in a somewhat sketchy neighborhood. However,  it's worth the trip.",
        "I ordered a large gizzard and was extremely disappointed! The gizzards were awful! They had absolutely no taste, very small and hard, no seasoning! Harolds use to have a distinctive taste not these!",
        "I ordered a 10 piece with lots of  sauce. They asked me if I wanted lemon pepper I said yes please. I pulled off and I opened up my bag and I saw that there was just a tiny squeeze of sauce on my chicken. That’s the whole reason of going to Harold’s is to get the sauce and there was absolutely no lemon pepper. Why even ask if you’re not going to put it on there highly disappointed, highly dissatisfied want my money back. Place looks very random down and terrible and the inside"
      ]
    },
    {
      "name": "Harold's Chicken #6",
      "address": "808 E 79th St, Chicago, IL 60619, USA",
      "neighborhood": "Chatham",
      "lat": 41.75141319999999,
      "lng": -87.6047396,
      "rating": 3.5,
      "reviewCount": 652,
      "reviews": [
        "3 wings was 7.71 they told me 8 dollars even which is not a big difference yet prices went up. He told me I might as well get a 4 piece for 10 dollars when the menu states 8.50. They are always late with food and never give lemon pepper. Paid the 10 for my 4 wings. ❤️ I just won’t be back nor refer this location to anyone again.",
        "They love to sale recooked rib tips! And don’t answer the phone,so you can’t even tell them about your order. Only thing fresh was the fries and they was under cooked smh.",
        "I had a late night craving for Harold’s and this hit the spot 🔥 I like how they add seasoning to the fries, I haven’t seen that at other Harold’s. The men working there were nice too",
        "The chicken batter is so properly seasoned the lemon pepper has has this sweet but lemony salty savory. It’s so good and you have to get the mild sauce on it get the mild sauce. I’m so sorry I don’t have any photos. It’s like the moment I got the chicken and got in the car. I literally inhaled it while I was driving back to my hotel room, so Harold do y’all thing.",
        "This was the worst Harolds I ever ever had\nThe chicken didn't taste like Harolds it tasted like I cooked it at home. The breast was super large and dry\nThe mild sauce on the fries was totally different than the mild sause I was given on the side. I wish I could upload the order I trashed and wasted $ on. I will not use Uber eats again it wouldn't say the address of the harolds BC I would have never ordered from that store. Maybe that's why they don't t\nhave a number attached to their store\nBEWARE!!!!!!"
      ]
    },
    {
      "name": "Harold's Chicken Shack #7",
      "address": "2132 S Michigan Ave, Chicago, IL 60616, USA",
      "neighborhood": "Grand Boulevard",
      "lat": 41.8532282,
      "lng": -87.624088,
      "rating": 3.4,
      "reviewCount": 760,
      "reviews": [
        "I ordered  gizzard and Wings, the wings  was great but the gizzard was if they were out the freezer microwave them fried ti add batter which might understand the wait after it was a phone order first. I tried to call but no answer and the voicemail is full. I like to have the business correct any mistakes first before I post a comment. Also a coworker on the same ordered Livers was so dark as if dark grease was used. FYI, if gizzards are not popular delete them from your menu! I would've order fish & wing.",
        "Food is amazing, service is super slow. The ladies behind the counter have no sense of urgency, not a care in the world. Waited over an hour, as people kept coming in she would tell them that the wait is only 20 minutes. She would ask customers to speak up when ordering, but when she called the numbers she would whisper.  Management needs to do better.",
        "It was about a 40 minute wait for my food which is understandable because it was after a bears game. I didn’t expect too much coming into this restaurant but man I was blown away by those chicken wings and mild sauce. Some of the best chicken wings I’ve ever had. Fries were a little bland and didn’t have salt which maybe you could’ve asked for some but they put sauce on them too which made them better. Overall a great experience and I’d definitely eat here again.",
        "My order is always the same, but today, I tried something different. 6 Wings, salt, pepper, and lemon pepper. Mild sauce on the side. This was more expensive than my typical 6 Wings, salt, pepper, lemon pepper and mild sauce. I stated just put the sauce on the chicken. I waited 30 minutes for my order. I got home and there wasn’t a drop of mild sauce on my chicken! But, I was charged for it. I’m disappointed! Couple this with fact last my order was mixed up with someone else’s order and was fried hard with pepper juice on it. The wait time, unpleasant attitudes, and order mishaps always ruin this experience for me. They collect your receipt to redeem your food which would make it difficult to resolve the issue once you’ve walked out the restaurant.",
        "🗣️TRASHHHHHHHHH!\n\nWent there to get a lemon pepper fried hard wing dinner  and salt and pepper wing dinner- started eating the chicken and saw that it was still raw on the inside- no lemon pepper in sight - no fried hard. I took it right back and  told them to look at it. Instead of them delivering good customer service and remaking  the order - they made me wait 30 mins while they made every new customer order - when I asked how much longer on the order the young woman at the woman caught an attitude.   I simply wanted to know much longer I needed to wait for a remake. 10 minutes after this…. Then- Some crip keeper man come out the back talking about - “we not gon service you no mo-“ at this point I just want my money back- so now we have to have a debate about that. Terrible customer service and they never know who they are servicing 😉. I had to tell the lady calm down at the window, stop yelling and give me money back- a whole hour+ from the initial order to returning it  to finally getting my refund. I had to go to the one on Wabash and Harrison just so I could get my kid her wings and fries. Horrible!!!"
      ]
    },
    {
      "name": "Harold's Chicken #8",
      "address": "Kimbark Plaza Parking Lot, 1208 E 53rd St, Chicago, IL 60615, USA",
      "neighborhood": "Hyde Park",
      "lat": 41.8000542,
      "lng": -87.5960602,
      "rating": 3.6,
      "reviewCount": 950,
      "reviews": [
        "Great tasting chicken but, damn do the employees have to pay for sauce out of pocket? This chicken is way too dry for the price!! Also, if you ask for more sauce they force you to buy extra in a cup which is not the same and defeats the purpose of adding sauce while the food is hot! I’m giving a 1 star because, this is not how original Harold’s is served!",
        "Normally I can order my food and pick it up without a problem but today when I went to pick up my order, I tried to tell one of the women, looks to be in her 40s, that I made an order and when I said my name, she ignored me and started calling numbers from 62 to 67, and then another woman walks up and said she called in an order, now another woman in the back gets her food and I’m trying to get mine after her but the older woman just calling numbers, still ignoring me. I finally tell the younger woman I ordered through grub hub and I tell her my name like I told the other woman and she gets my food for me. I don’t know what the older lady’s problem was but she needs to get better customer service skills or stop working the register. It doesn’t take a lot just to learn to listen  and stop ignoring people especially when they’re not disrespectful. I won’t be coming back here ever again.",
        "I purchased 5 wings and they were pretty decent but the fries were hard, dry, and some what soggy. Can't eat chicken from harolds if fries not right. Places since Covid have really went down",
        "Not going to lie I gave up on this Harold’s years ago because the food quality and service had fallen off. But today I decided to give it another chance and ordered 15 wings. The line was long but they were moving people in and out quick. And honestly… they made a comeback. The chicken was fye, fresh, and crunchy just how I like it. Even my 5-year-old said Mama this chicken fye",
        "I ordered a fourth white with just lemon pepper I received what looked like a fried rat with a bunch of sauce ,this Harolds has went really down and when you try to call, they don’t pick up the phone. I wouldn’t recommend this place at all."
      ]
    },
    {
      "name": "Harold's Chicken Shack #9",
      "address": "1501 W Madison St, Chicago, IL 60607, USA",
      "neighborhood": "Austin",
      "lat": 41.8812515,
      "lng": -87.66490220000001,
      "rating": 3.6,
      "reviewCount": 1455,
      "reviews": [
        "I can never leave home without stopping at Harold’s.The food tastes just like I remember growing up. I got a perch and wing meal with mild sauce and then a 6 piece wing for the next day. It was busy due to it being the night before Christmas. Ordered before I got there and everything was hot and ready. If only there was a location near me 😩 Everything was outstanding.",
        "Ordered my food online and it was ready at the given time. There is plenty of paid street parking but if you run in and run out you can probably avoid having to pay. The cashier greeted me and he was pleasant. My order was correct. The fries and chicken were piping hot, fried correctly, and fresh.\n\nI hadn't ate Harolds in maybe 5 years before today. I just think there are better options for the price. $10 for 4 wings and fries is a bit much to not be perfect. The chicken was hot and fresh but lacked flavor. The only seasoning I tasted was the salt and pepper I requested.\n\nWould I eat it again? Yes. But it will probably be another 5 years.",
        "I ordered 6 wings (mild sauce on side + hot pepper) via Uber Eats and this is what was delivered to me. 5 tiny wings and a handful of fries. For $30 on the app (I get fees and all). But what a disappointment! Please do better!",
        "The restaurant is good for a snack. There is a big menu but unfortunately they only had fries as sides available (maybe because we joined for only lunch).\nThe wings with its mild sauce was very good.",
        "This place is extremely famous for their chicken and we were quite happy with the food! We tried their shrimp, chicken tenders, wings, green tomatoes and hush-puppies. Everything tasted good even if the mild sauce was a little too mild, adding little taste. It is possible to park in the from of the restaurant and the area looked okay. If you are in the area you should give it a try!"
      ]
    },
    {
      "name": "Harold's Chicken #10",
      "address": "9151 S Ashland Ave, Chicago, IL 60620, USA",
      "neighborhood": "Englewood",
      "lat": 41.7269865,
      "lng": -87.6624969,
      "rating": 3.6,
      "reviewCount": 693,
      "reviews": [
        "When I placed my order the cook was distracted by a phone call about his family members in Danville and selling their furniture. While listening to his call and the wait time for my order, I knew my order would be wrong!!! The woman that worked the register asked him what was the order in front of her and he said gizzard and wing combo. She informed him that it was a large gizzard and 6 wings he told her to just take the wings off!!! None the less my large gizzard is now a small gizzard I wanted them fried soft and they are hard as bricks…. The cook had the nerve to open the door to tell me that a large gizzard come in a combo. No refunds and no recooking even if they messed up your order!!!!! Used to be my favorite but, I’m never going back!!!!",
        "I used to be a Harold's chicken addict. I could tell you which chicken shack had the best chicken, which one had the best gizzards. This chicken shack food I ordered on 5/5/25 was terrible. I should have had tacos. I ordered the chicken and gizzard combo with mild sauce. I was told 15 mins the food would be ready. When I got to my destination and opened the bag. I didn't know if they gave me a chicken or a Cornish hen wing. The wings were so small. The fries were half sized. My friend asked me,'Did they have any whole french fries?' I laughed. The gizzards were just ok. The two wings on the picture made its way to the garbage, along with some fries and gizzards. I don't have to return to this location. I know a bar that sells chicken wings and gizzards MUCH better than this Harold's.",
        "My people we got to do better, lets not say we cook to order and refry the same wings you cooked this morning. I paid for 40 bucks for 16 wings and 2 hot peppers, I should’ve checked my food but I was so hungry that I was ready to go home and eat. Got to my location and they had given me some old chicken. To top it off the lady who took my order was outside smoking a cigarette and didn’t wash her hands when she returned. Luckily someone else came in and packed my chicken. This experience has been a first for this location but unfortunately I will not be patronizing this location ever again. Please do better Harold’s chicken #4",
        "Me and my grandmother have eaten their chicken 2-3 times now. The best Harold's I've had in years for sure!",
        "My Daughter said this place just reopened and they are REALLY GOOD. I stopped In after work today I placed an order @4:49pm for a 1/2 Reg Salt & Pepper Only.  At 5:17pm I got my food went to the car checked my order it was Loaded With Mild Sauce.. I took it back told them I have the wrong order they told me their ticket has mild sauce on it.  I showed the guy my Receipt that showed Salt & Pepper Only. They apologized and cooked me a new order unfortunately I didn't leave until 5:48= 1 Hour for food that had No Flavor. I was not Happy I don't think I'll be going back. I only waited b/c my Daughter said Mom it's gonna be Good NOT SO MUCH!!!\nMz.Sand"
      ]
    }
  ]
}